extends Node


signal set_current_step(step: int, step_name: String)
signal set_max_step(max_step: int)
signal error(error: String)


const errors: Dictionary = {
	"InvalidName": "The custom font name is invalid.",
	"FontNotFound": "The font file couldn't be found.",
	"InvalidFile": "The font format is not valid. Only .ttf and .otf are supported."
}


const valid_extensions: PackedStringArray = [
	"ttf",
	"ttc",
	"otf"
]


const steps: Dictionary = {
	1: 'Generating "null".',
	2: 'Generating "basic-latin".',
	3: 'Generating "latin-supplement".',
	4: 'Generating "latin-extended-a".',
	5: 'Generating "latin-extended-b1".',
	6: 'Generating "latin-extended-b2".',
	7: 'Generating "latin-extended-c".',
	8: 'Generating "latin-extended-d".',
	9: 'Generating "latin-extended-additional".',
	10: 'Generating "ipa-extensions".',
	11: 'Generating "spacing-modifiers".',
	12: 'Generating "basic-japanese".',
	13: 'Generating "symbol".',
	14: 'Generating "symbol2".',
	15: 'Generating "symbol3".',
	16: 'Generating "kanji-regular 1".',
	17: 'Generating "kanji-regular 2".',
	18: 'Generating "kanji-regular 3".',
	19: 'Generating "kanji-jis1".',
	20: 'Generating "kanji-jis2 1".',
	21: 'Generating "kanji-jis2 2".',
	22: 'Generating "kanji-jis2 3".',
	23: 'Generating "kanji-jis2 4".',
	24: 'Generating "kanji-ibm".',
	25: 'Generating "compatible".',
	26: 'Generating "Jamo01".',
	27: 'Generating "Jamo02".',
	28: 'Generating "Jamo03".',
	29: 'Generating "Jamo04".',
	30: 'Generating "Jamo05".',
	31: 'Generating "Jamo06".',
	32: 'Generating "Jamo07".',
	33: 'Generating "Jamo08".',
	34: 'Generating "Jamo09".',
	35: 'Generating "Jamo10".',
	36: 'Generating "Jamo11".',
	37: 'Generating "Jamo12".',
	38: 'Generating "Jamo13".',
	39: 'Generating "Jamo14".',
	40: 'Generating "Jamo15".',
	41: 'Generating "Jamo16".',
	42: 'Generating "Jamo17".',
	43: 'Generating "Jamo18".',
	44: 'Generating "Jamo19".',
	45: 'Generating "Jamo20".',
	46: 'Generating "symbol-gbk1".',
	47: 'Generating "kanji-gbk2 1".',
	48: 'Generating "kanji-gbk2 2".',
	49: 'Generating "kanji-gbk2 3".',
	50: 'Generating .ini file.',
	51: "Done!"
}


# Each file that will get generated, with all their contents.
const sections: Dictionary = {
	"null": {
		"Line 0" = "�",
	},
	"basic-latin": {
		"Line 0" = " !\"#$%&\'()*+,-./",
		"Line 1" = "0123456789:;<=>?",
		"Line 2" = "@ABCDEFGHIJKLMNO",
		"Line 3" = "PQRSTUVWXYZ[\\]^_",
		"Line 4" = "`abcdefghijklmno",
		"Line 5" = "pqrstuvwxyz{|}~",
	},
	"latin-supplement": {
		"Line 0" = " ¡¢£¤¥¦§¨©ª«¬­®¯",
		"Line 1" = "°±²³´µ¶·¸¹º»¼½¾¿",
		"Line 2" = "ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ",
		"Line 3" = "ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß",
		"Line 4" = "àáâãäåæçèéêëìíîï",
		"Line 5" = "ðñòóôõö÷øùúûüýþÿ",
	},
	"latin-extended-a": {
		"Line 0" = "ĀāĂăĄąĆćĈĉĊċČčĎď",
		"Line 1" = "ĐđĒēĔĕĖėĘęĚěĜĝĞğ",
		"Line 2" = "ĠġĢģĤĥĦħĨĩĪīĬĭĮį",
		"Line 3" = "İıĲĳĴĵĶķĸĹĺĻļĽľĿ",
		"Line 4" = "ŀŁłŃńŅņŇňŉŊŋŌōŎŏ",
		"Line 5" = "ŐőŒœŔŕŖŗŘřŚśŜŝŞş",
		"Line 6" = "ŠšŢţŤťŦŧŨũŪūŬŭŮů",
		"Line 7" = "ŰűŲųŴŵŶŷŸŹźŻżŽžſ",
	},
	"latin-extended-b1": {
		"Line 0" = "ƀƁƂƃƄƅƆƇƈƉƊƋƌƍƎƏ",
		"Line 1" = "ƐƑƒƓƔƕƖƗƘƙƚƛƜƝƞƟ",
		"Line 2" = "ƠơƢƣƤƥƦƧƨƩƪƫƬƭƮƯ",
		"Line 3" = "ưƱƲƳƴƵƶƷƸƹƺƻƼƽƾƿ",
		"Line 4" = "ǀǁǂǃǄǅǆǇǈǉǊǋǌǍǎǏ",
		"Line 5" = "ǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟ",
	},
	"latin-extended-b2": {
		"Line 0" = "ǠǡǢǣǤǥǦǧǨǩǪǫǬǭǮǯ",
		"Line 1" = "ǰǱǲǳǴǵǶǷǸǹǺǻǼǽǾǿ",
		"Line 2" = "ȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏ",
		"Line 3" = "ȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟ",
		"Line 4" = "ȠȡȢȣȤȥȦȧȨȩȪȫȬȭȮȯ",
		"Line 5" = "ȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿ",
		"Line 6" = "ɀɁɂɃɄɅɆɇɈɉɊɋɌɍɎɏ",
	},
	"latin-extended-c": {
		"Line 0" = "ⱠⱡⱢⱣⱤⱥⱦⱧ",
		"Line 1" = "ⱨⱩⱪⱬⱬⱭⱮⱯ",
		"Line 2" = "ⱰⱱⱲⱳⱴⱵⱶⱷ",
		"Line 3" = "ⱸⱹⱺⱻⱼⱽ",
	},
	"latin-extended-d": {
		"Line  0" = "꜠꜡ꜢꜣꜤꜥꜦꜧꜨꜩꜪꜫꜬꜭꜮꜯ",
		"Line  1" = "ꜰꜱꜲꜳꜴꜵꜶꜷꜸꜹꜺꜻꜼꜽꜾꜿ",
		"Line  2" = "ꝀꝁꝂꝃꝄꝅꝆꝇꝈꝉꝊꝋꝌꝍꝎꝏ",
		"Line  3" = "ꝐꝑꝒꝓꝔꝕꝖꝗꝘꝙꝚꝛꝜꝝꝞꝟ",
		"Line  4" = "ꝠꝡꝢꝣꝤꝥꝦꝧꝨꝩꝪꝫꝬꝭꝮꝯ",
		"Line  5" = "ꝰꝱꝲꝳꝴꝵꝶꝷꝸꝹꝺꝻꝼꝽꝾꝿ",
		"Line  6" = "ꞀꞁꞂꞃꞄꞅꞆꞇꞈ꞉꞊ꞋꞌꞍꞎꞏ",
		"Line  7" = "ꞐꞑꞒꞓꞔꞕꞖꞗꞘꞙꞚꞛꞜꞝꞞꞟ",
		"Line  8" = "ꞠꞡꞢꞣꞤꞥꞦꞧꞨꞩꞪꞫꞬꞭꞮꞯ",
		"Line  9" = "ꞰꞱꞲꞳꞴꞵꞶꞷꞸꞹꞺꞻꞼꞽꞾꞿ",
		"Line 10" = "ꟀꟁꟂꟃꟄꟅꟆꟇꟈꟉꟊꟐꟑ꟒ꟓ꟔",
		"Line 11" = "ꟕꟖꟗꟘꟙꟲꟳꟴꟵꟶꟷꟸꟹꟺꟻꟼ",
		"Line 12" = "ꟽꟾꟿ",
	},
	"latin-extended-additional": {
		"Line 0" = "ḀḁḂḃḄḅḆḇḈḉḊḋḌḍḎḏḐḑḒḓḔḕḖḗḘḙḚḛḜḝḞḟ",
		"Line 1" = "ḠḡḢḣḤḥḦḧḨḩḪḫḬḭḮḯḰḱḲḳḴḵḶḷḸḹḺḻḼḽḾḿ",
		"Line 2" = "ṀṁṂṃṄṅṆṇṈṉṊṋṌṍṎṏṐṑṒṓṔṕṖṗṘṙṚṛṜṝṞṟ",
		"Line 3" = "ṠṡṢṣṤṥṦṧṨṩṪṫṬṭṮṯṰṱṲṳṴṵṶṷṸṹṺṻṼṽṾṿ",
		"Line 4" = "ẀẁẂẃẄẅẆẇẈẉẊẋẌẍẎẏẐẑẒẓẔẕẖẗẘẙẚẛẜẝẞẟ",
		"Line 5" = "ẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾế",
		"Line 6" = "ỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞở",
		"Line 7" = "ỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹỺỻỼỽỾỿ",
		"Line 8" = "₫",
	},
	"ipa-extensions": {
		"Line 0" = "ɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟ",
		"Line 1" = "ɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯ",
		"Line 2" = "ɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿ",
		"Line 3" = "ʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏ",
		"Line 4" = "ʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟ",
		"Line 5" = "ʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯ",
	},
	"spacing-modifiers": {
		"Line 0" = "ʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿ",
		"Line 1" = "ˀˁ˂˃˄˅ˆˇˈˉˊˋˌˍˎˏ",
		"Line 2" = "ːˑ˒˓˔˕˖˗˘˙˚˛˜˝˞˟",
		"Line 3" = "ˠˡˢˣˤ˥˦˧˨˩˪˫ˬ˭ˮ˯",
		"Line 4" = "˰˱˲˳˴˵˶˷˸˹˺˻˼˽˾˿",
	},
	"basic-japanese": {
		"Line  0" = "　、。〃〄々〆〇〈〉《》「」『』",
		"Line  1" = "【】〒〓〔〕〖〗〘〙〚〛〜〝〞〟",
		"Line  2" = "〠〡〢〣〤〥〦〧〨〩〪〭〮〯〫〬",
		"Line  3" = "〰〱〲〳〴〵〶〷〸〹〺〻〼〽〾〿",
		"Line  4" = "぀ぁあぃいぅうぇえぉおかがきぎく",
		"Line  5" = "ぐけげこごさざしじすずせぜそぞた",
		"Line  6" = "だちぢっつづてでとどなにぬねのは",
		"Line  7" = "ばぱひびぴふぶぷへべぺほぼぽまみ",
		"Line  8" = "むめもゃやゅゆょよらりるれろゎわ",
		"Line  9" = "ゐゑをんゔゕゖ゗゘゙゚゛゜ゝゞゟ",
		"Line 10" = "゠ァアィイゥウェエォオカガキギク",
		"Line 11" = "グケゲコゴサザシジスズセゼソゾタ",
		"Line 12" = "ダチヂッツヅテデトドナニヌネノハ",
		"Line 13" = "バパヒビピフブプヘベペホボポマミ",
		"Line 14" = "ムメモャヤュユョヨラリルレロヮワ",
		"Line 15" = "ヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿ",
	},
	"symbol": {
		"Line 0" = "＆（）？！／‥＾…＠＄＃”＋＝￥；＜＞・「」｛｝％＊",
		"Line 1" = "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ",
		"Line 2" = "ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ",
	},
	"symbol2": {
		"Line  0" = "，．：´｀¨‾＿仝—‐＼‖｜‘’",
		"Line  1" = "“［］−±×÷≠≦≧∞∴♂♀°′",
		"Line  2" = "″℃¢£§☆★○●◎◇◆□■△▲",
		"Line  3" = "▽▼※→←↑↓∈∋⊆⊇⊂⊃∪∩∧",
		"Line  4" = "∨¬⇒⇔∀∃∠⊥⌒∂∇≡≒≪≫√",
		"Line  5" = "∽∝∵∫∬Å‰♯♭♪†‡¶◯０１",
		"Line  6" = "２３４５６７８９ΑΒΓΔΕΖΗΘ",
		"Line  7" = "ΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ",
		"Line  8" = "αβγδεζηθικλμνξοπ",
		"Line  9" = "ρστυχψωАБВГДЕЁЖЗ",
		"Line 10" = "ИЙКЛМНОПРСТУФХЦЧ",
		"Line 11" = "ШЩЪЫЬЭЮЯабвгдеёж",
		"Line 12" = "зийклмнопрстуфхц",
		"Line 13" = "чшщъыьэюя─│┌┐┘└├",
		"Line 14" = "┬┤┴┼━┃┏┓┛┗┣┳┫┻╋┠",
		"Line 15" = "┯┨┷┿┝┰┥┸╂",
	},
	"symbol3": {
		"Line 0" = "①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯",
		"Line 1" = "⑰⑱⑲⑳ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ㍉㌔",
		"Line 2" = "㌢㍍㌘㌧㌃㌶㍑㍗㌍㌦㌣㌫㍊㌻㎜㎝",
		"Line 3" = "㎞㎎㎏㏄㎡㍻№㏍℡㊤㊥㊦㊧㊨㈱㈲",
		"Line 4" = "㈹㍾㍽㍼∮∟⊿ⅰⅱⅲⅳⅴⅵⅶⅷⅸ",
		"Line 5" = "ⅹ￤＇＂",
	},
	"kanji-regular 1": {
		"Line  0" = "亜哀愛悪握圧扱安暗案以位依偉囲委威尉意慰易為異移維緯胃衣違遺医井",
		"Line  1" = "域育一壱逸稲芋印員因姻引飲院陰隠韻右宇羽雨渦浦運雲営影映栄永泳英",
		"Line  2" = "衛詠鋭液疫益駅悦謁越閲円園宴延援沿演炎煙猿縁遠鉛塩汚凹央奥往応押",
		"Line  3" = "横欧殴王翁黄沖億屋憶乙卸恩温穏音下化仮何価佳加可夏嫁家寡科暇果架",
		"Line  4" = "歌河火禍稼箇花荷華菓課貨過蚊我画芽賀雅餓介会解回塊壊快怪悔懐戒拐",
		"Line  5" = "改械海灰界皆絵開階貝劾外害慨概涯街該垣嚇各拡格核殻獲確穫覚角較郭",
		"Line  6" = "閣隔革学岳楽額掛潟割喝括活渇滑褐轄且株刈乾冠寒刊勘勧巻喚堪完官寛",
		"Line  7" = "干幹患感慣憾換敢棺款歓汗漢環甘監看管簡緩缶肝艦観貫還鑑間閑関陥館",
		"Line  8" = "丸含岸眼岩頑顔願企危喜器基奇寄岐希幾忌揮机旗既期棋棄機帰気汽祈季",
		"Line  9" = "紀規記貴起軌輝飢騎鬼偽儀宜戯技擬欺犠疑義議菊吉喫詰却客脚虐逆丘久",
		"Line 10" = "休及吸宮弓急救朽求泣球究窮級糾給旧牛去居巨拒拠挙虚許距漁魚享京供",
		"Line 11" = "競共凶協叫境峡強恐恭挟教橋況狂狭矯胸脅興郷鏡響驚仰凝暁業局曲極玉",
		"Line 12" = "勤均斤琴禁筋緊菌襟謹近金吟銀九句区苦駆具愚虞空偶遇隅屈掘靴繰桑勲",
		"Line 13" = "君薫訓群軍郡係傾刑兄啓型契形径恵慶憩掲携敬景渓系経継茎蛍計警軽鶏",
		"Line 14" = "芸迎鯨劇撃激傑欠決潔穴結血月件倹健兼券剣圏堅嫌建憲懸検権犬献研絹",
		"Line 15" = "県肩見謙賢軒遣険顕験元原厳幻弦減源玄現言限個古呼固孤己庫弧戸故枯",
		"Line 16" = "湖誇雇顧鼓五互午呉娯後御悟碁語誤護交侯候光公功効厚口向后坑好孔孝",
		"Line 17" = "工巧幸広康恒慌抗拘控攻更校構江洪港溝甲皇硬稿紅絞綱耕考肯航荒行衡",
		"Line 18" = "講貢購郊酵鉱鋼降項香高剛号合拷豪克刻告国穀酷黒獄腰骨込今困墾婚恨",
		"Line 19" = "懇昆根混紺魂佐唆左差査砂詐鎖座債催再最妻宰彩才採栽歳済災砕祭斎細",
		"Line 20" = "菜裁載際剤在材罪財坂咲崎作削搾昨策索錯桜冊刷察撮擦札殺雑皿三傘参",
		"Line 21" = "山惨散桟産算蚕賛酸暫残仕伺使刺司史嗣四士始姉姿子市師志思指支施旨",
		"Line 22" = "枝止死氏祉私糸紙紫肢脂至視詞詩試誌諮資賜雌飼歯事似侍児字寺慈持時",
		"Line 23" = "次滋治璽磁示耳自辞式識軸七執失室湿漆疾質実芝舎写射捨赦斜煮社者謝",
		"Line 24" = "車遮蛇邪借勺尺爵酌釈若寂弱主取守手朱殊狩珠種趣酒首儒受寿授樹需囚",
		"Line 25" = "収周宗就州修愁拾秀秋終習臭舟衆襲週酬集醜住充十従柔汁渋獣縦重銃叔",
		"Line 26" = "宿淑祝縮粛塾熟出術述俊春瞬准循旬殉準潤盾純巡遵順処初所暑庶緒署書",
		"Line 27" = "諸助叙女序徐除傷償勝匠升召商唱奨宵将小少尚床彰承抄招掌昇昭晶松沼",
		"Line 28" = "消渉焼焦照症省硝礁祥称章笑粧紹肖衝訟証詔詳象賞鐘障上丈乗冗剰城場",
		"Line 29" = "壌嬢常情条浄状畳蒸譲醸錠嘱飾植殖織職色触食辱伸信侵唇娠寝審心慎振",
		"Line 30" = "新森浸深申真神紳臣薪親診身辛進針震人仁刃尋甚尽迅陣酢図吹垂帥推水",
		"Line 31" = "炊睡粋衰遂酔錘随髄崇数枢据杉澄寸世瀬畝是制勢姓征性成政整星晴正清",
	},
	"kanji-regular 2": {
		"Line  0" = "牲生盛精聖声製西誠誓請逝青静斉税隻席惜斥昔析石積籍績責赤跡切拙接",
		"Line  1" = "摂折設窃節説雪絶舌仙先千占宣専川戦扇栓泉浅洗染潜旋線繊船薦践選遷",
		"Line  2" = "銭銑鮮前善漸然全禅繕塑措疎礎祖租粗素組訴阻僧創双倉喪壮奏層想捜掃",
		"Line  3" = "挿操早曹巣槽燥争相窓総草荘葬藻装走送遭霜騒像増憎臓蔵贈造促側則即",
		"Line  4" = "息束測足速俗属賊族続卒存孫尊損村他多太堕妥惰打駄体対耐帯待怠態替",
		"Line  5" = "泰滞胎袋貸退逮隊代台大第題滝卓宅択拓沢濯託濁諾但達奪脱棚谷丹単嘆",
		"Line  6" = "担探淡炭短端胆誕鍛団壇弾断暖段男談値知地恥池痴稚置致遅築畜竹蓄逐",
		"Line  7" = "秩窒茶嫡着中仲宙忠抽昼柱注虫衷鋳駐著貯丁兆帳庁弔張彫徴懲挑朝潮町",
		"Line  8" = "眺聴脹腸調超跳長頂鳥勅直朕沈珍賃鎮陳津墜追痛通塚漬坪釣亭低停偵貞",
		"Line  9" = "呈堤定帝底庭廷弟抵提程締艇訂逓邸泥摘敵滴的笛適哲徹撤迭鉄典天展店",
		"Line 10" = "添転点伝殿田電吐塗徒斗渡登途都努度土奴怒倒党冬凍刀唐塔島悼投搭東",
		"Line 11" = "桃棟盗湯灯当痘等答筒糖統到討謄豆踏逃透陶頭騰闘働動同堂導洞童胴道",
		"Line 12" = "銅峠匿得徳特督篤毒独読凸突届屯豚曇鈍内縄南軟難二尼弐肉日乳入如尿",
		"Line 13" = "任妊忍認寧猫熱年念燃粘悩濃納能脳農把覇波派破婆馬俳廃拝排敗杯背肺",
		"Line 14" = "輩配倍培媒梅買売賠陪伯博拍泊白舶薄迫漠爆縛麦箱肌畑八鉢発髪伐罰抜",
		"Line 15" = "閥伴判半反帆搬板版犯班畔繁般藩販範煩頒飯晩番盤蛮卑否妃彼悲扉批披",
		"Line 16" = "比泌疲皮碑秘罷肥被費避非飛備尾微美鼻匹必筆姫百俵標氷漂票表評描病",
		"Line 17" = "秒苗品浜貧賓頻敏瓶不付夫婦富布府怖扶敷普浮父符腐膚譜負賦赴附侮武",
		"Line 18" = "舞部封風伏副復幅服福腹複覆払沸仏物分噴墳憤奮粉紛雰文聞丙併兵塀幣",
		"Line 19" = "平弊柄並閉陛米壁癖別偏変片編辺返遍便勉弁保舗捕歩補穂募墓慕暮母簿",
		"Line 20" = "倣俸包報奉宝峰崩抱放方法泡砲縫胞芳褒訪豊邦飽乏亡傍剖坊妨帽忘忙房",
		"Line 21" = "暴望某棒冒紡肪膨謀貿防北僕墨撲朴牧没堀奔本翻凡盆摩磨魔麻埋妹枚毎",
		"Line 22" = "幕膜又抹末繭万慢満漫味未魅岬密脈妙民眠務夢無矛霧婿娘名命明盟迷銘",
		"Line 23" = "鳴滅免綿面模茂妄毛猛盲網耗木黙目戻問紋門匁夜野矢厄役約薬訳躍柳愉",
		"Line 24" = "油癒諭輸唯優勇友幽悠憂有猶由裕誘遊郵雄融夕予余与誉預幼容庸揚揺擁",
		"Line 25" = "曜様洋溶用窯羊葉要謡踊陽養抑欲浴翌翼羅裸来頼雷絡落酪乱卵欄濫覧利",
		"Line 26" = "吏履理痢裏里離陸律率立略流留硫粒隆竜慮旅虜了僚両寮料涼猟療糧良量",
		"Line 27" = "陵領力緑倫厘林臨輪隣塁涙累類令例冷励礼鈴隷零霊麗齢暦歴列劣烈裂廉",
		"Line 28" = "恋練連錬炉路露労廊朗楼浪漏老郎六録論和話賄惑枠湾腕",
	},
	"kanji-regular 3": {
		"Line  0" = "挨曖宛嵐畏萎椅彙茨咽淫唄鬱怨媛艶",
		"Line  1" = "旺岡臆俺苛牙瓦楷潰諧崖蓋骸柿顎葛",
		"Line  2" = "釜鎌韓玩伎亀毀畿臼嗅巾僅錦惧串窟",
		"Line  3" = "熊詣憬稽隙桁拳鍵舷股虎錮勾梗喉乞",
		"Line  4" = "傲駒頃痕沙挫采塞埼柵刹拶斬恣摯餌",
		"Line  5" = "鹿𠮟嫉腫呪袖羞蹴憧拭尻芯腎須裾凄",
		"Line  6" = "醒脊戚煎羨腺詮箋膳狙遡曽爽痩踪捉",
		"Line  7" = "遜汰唾堆戴誰旦綻緻酎貼嘲捗椎爪鶴",
		"Line  8" = "諦溺塡妬賭藤瞳栃頓貪丼那奈梨謎鍋",
		"Line  9" = "匂虹捻罵剝箸氾汎阪斑眉膝肘訃阜蔽",
		"Line 10" = "餅璧蔑哺蜂貌頰睦勃昧枕蜜冥麺冶弥",
		"Line 11" = "闇喩湧妖瘍沃拉辣藍璃慄侶瞭瑠呂賂",
		"Line 12" = "弄籠麓脇",
	},
	"kanji-jis1": {
		"Line  0" = "唖娃阿姶逢葵茜穐渥旭葦芦鯵梓斡姐虻飴絢綾鮎或粟袷庵按鞍杏伊夷惟謂",
		"Line  1" = "亥郁磯溢鰯允胤蔭吋烏迂卯鵜窺丑碓嘘欝蔚鰻姥厩瓜閏噂云荏叡嬰曳洩瑛",
		"Line  2" = "盈穎頴榎厭堰奄掩焔燕苑薗鴛於甥襖鴬鴎荻桶牡伽嘉珂禾茄蝦嘩迦霞俄峨",
		"Line  3" = "臥蛾駕廻恢魁晦芥蟹凱咳碍鎧浬馨蛙蛎鈎劃廓撹赫笠樫橿梶鰍恰鰹叶椛樺",
		"Line  4" = "鞄兜竃蒲噛鴨栢茅萱粥苅侃姦柑桓澗潅竿翰莞諌舘巌癌翫贋雁嬉毅稀徽妓",
		"Line  5" = "祇蟻誼掬鞠吃桔橘砧杵黍仇汲灸笈渠鋸禦亨侠僑兇匡卿喬彊怯蕎饗尭桐粁",
		"Line  6" = "欣欽禽芹衿倶狗玖矩躯駈喰寓櫛釧屑沓轡窪隈粂栗鍬卦袈祁圭珪慧桂畦繋",
		"Line  7" = "罫荊頚戟訣倦喧捲牽硯鹸絃諺乎姑狐糊袴胡菰跨鈷伍吾梧檎瑚醐鯉佼倖垢",
		"Line  8" = "宏巷庚弘昂晃杭浩糠紘肱腔膏砿閤鴻劫壕濠轟麹鵠漉甑忽惚狛此坤昏梱艮",
		"Line  9" = "些叉嵯瑳裟坐哉犀砦冴堺榊肴碕鷺咋朔窄鮭笹匙薩皐鯖捌錆鮫晒撒燦珊纂",
		"Line 10" = "讃餐仔屍孜斯獅爾痔而蒔汐鴫竺宍雫叱悉蔀篠偲柴屡蕊縞紗杓灼錫惹綬洲",
		"Line 11" = "繍蒐讐輯酋什戎夙峻竣舜駿楯淳醇曙渚薯藷恕鋤哨嘗妾娼庄廠捷昌梢樟樵",
		"Line 12" = "湘菖蒋蕉裳醤鉦鍾鞘丞擾杖穣埴燭蝕晋榛疹秦塵壬訊靭笥諏厨逗翠錐瑞嵩",
		"Line 13" = "趨雛椙菅頗雀摺棲栖脆蹟碩蝉尖撰栴煽穿箭舛賎閃糎噌岨曾楚疏蘇鼠叢宋",
		"Line 14" = "匝惣掻槍漕糟綜聡蒼鎗其揃詑柁舵楕陀騨岱腿苔黛鯛醍鷹瀧啄托琢鐸茸凧",
		"Line 15" = "蛸只叩辰巽竪辿狸鱈樽坦歎湛箪耽蛋檀弛智蜘馳筑註樗瀦猪苧凋喋寵帖暢",
		"Line 16" = "牒蝶諜銚槌鎚栂掴槻佃柘辻蔦綴鍔椿壷嬬紬吊剃悌挺梯汀碇禎蹄鄭釘鼎擢",
		"Line 17" = "鏑轍填纏甜顛澱兎堵屠杜菟鍍砥砺塘套宕嶋梼淘涛燈祷董蕩鐙撞萄鴇涜禿",
		"Line 18" = "橡椴鳶苫寅酉瀞噸惇敦沌遁呑乍凪薙灘捺楢馴畷楠汝迩賑廿韮濡禰祢葱撚",
		"Line 19" = "乃廼之埜嚢膿覗蚤巴播杷琶芭盃牌楳煤狽這蝿秤矧萩剥柏箔粕曝莫駁函硲",
		"Line 20" = "肇筈櫨幡畠溌醗筏鳩噺塙蛤隼叛釆挽磐蕃匪庇斐緋誹樋簸枇毘琵柊稗疋髭",
		"Line 21" = "彦菱弼畢逼桧紐謬彪瓢豹廟錨鋲蒜蛭鰭彬斌瀕埠冨斧芙撫葡蕪楓葺蕗淵弗",
		"Line 22" = "鮒吻扮焚糞頁僻碧瞥箆篇娩鞭鋪圃甫輔戊菩呆峯庖捧朋烹萌蓬鋒鳳鵬鉾吠",
		"Line 23" = "頬卜穆釦殆幌哩槙鮪柾鱒桝亦俣沫迄侭麿蔓巳箕湊蓑稔粍牟鵡椋姪牝棉緬",
		"Line 24" = "摸孟蒙儲杢勿尤籾貰悶也爺耶靖薮鑓愈佑宥揖柚涌猷祐邑輿傭楊熔耀蓉遥",
		"Line 25" = "慾淀螺莱洛蘭李裡葎掠劉溜琉龍亮凌梁稜諒遼淋燐琳鱗麟伶嶺怜玲苓憐漣",
		"Line 26" = "煉簾聯蓮魯櫓婁榔牢狼篭聾蝋禄肋倭歪鷲亙亘鰐詫藁蕨椀碗",
	},
	"kanji-jis2 1": {
		"Line  0" = "弌丐丕个丱丶丿乂乖乘亂亅豫亊舒弍于亞亟亠亢亰亳亶从仍仄仆仂仗仞仭",
		"Line  1" = "仟价伉佚估佛佝佗佇佶侈侏侘佻佩佰侑佯來侖儘俔俟俎俘俛俑俚俐俤俥倚",
		"Line  2" = "倨倔倪倥倅伜俶倡倩倬俾俯們倆偃假會偕偐偈做偖偬偸傀傚傅傴僉僊傳僂",
		"Line  3" = "僖僞僥僭僣僮價僵儉儁儂儖儕儔儚儡儺儷儼儻儿兀兒兌兔兢竸兩兪兮冀冂",
		"Line  4" = "囘册冉冏冑冓冕冖冤冦冢冩冪冫决冱冲冰况冽凅凉凛几處凩凭凰凵凾刄刋",
		"Line  5" = "刔刎刧刪刮刳剏剄剋剌剞剔剪剴剩剳剿剽劍劔劒剱劈劑辨辧劬劭劼劵勁勍",
		"Line  6" = "勗勞勣勦飭勠勳勵勸勹匆匈甸匍匐匏匕匚匣匯匱匳匸區卆卅丗卉卍凖卞卩",
		"Line  7" = "卮夘卻卷厂厖厠厦厥厮厰厶參簒雙叟曼燮叮叨叭叺吁吽呀听吭吼吮吶吩吝",
		"Line  8" = "呎咏呵咎呟呱呷呰咒呻咀呶咄咐咆哇咢咸咥咬哄哈咨咫哂咤咾咼哘哥哦唏",
		"Line  9" = "唔哽哮哭哢唹啀啣啌售啜啅啖啗唸唳啝喙喀咯喊喟啻啾喘喞單啼喃喇喨嗚",
		"Line 10" = "嗟嗄嗜嗤嗔嘔嗷嘖嗾嗽嘛嗹噎噐營嘴嘶嘸噫噤嘯噬噪嚆嚀嚊嚠嚔嚏嚥嚮嚶",
		"Line 11" = "嚴囂嚼囁囃囀囈囎囑囓囗囮囹圀囿圄圉圈國圍圓團圖嗇圜圦圷圸坎圻址坏",
		"Line 12" = "坩埀垈坡坿垉垓垠垳垤垪垰埃埆埔埒埓堊埖埣堋堙堝塲堡塢塋塰塒堽塹墅",
		"Line 13" = "墹墟墫墺壞墻墸墮壅壓壑壗壙壘壥壜壤壟壯壺壹壻壼壽夂夊夐夛梦夥夬夭",
		"Line 14" = "夲夸夾竒奕奐奎奚奘奢奠奧奬奩奸妁妝佞侫妣妲姆姨姜妍姙姚娥娟娑娜娉",
		"Line 15" = "娚婀婬婉娵娶婢婪媚媼媾嫋嫂媽嫣嫗嫦嫩嫖嫺嫻嬌嬋嬖嬲嫐嬪嬶嬾孃孅孀",
		"Line 16" = "孑孕孚孛孥孩孰孳孵學斈孺宀它宦宸寃寇寉寔寐寤實寢寞寥寫寰寶寳尅將",
		"Line 17" = "專對尓尠尢尨尸尹屁屆屎屓屐屏孱屬屮乢屶屹岌岑岔妛岫岻岶岼岷峅岾峇",
		"Line 18" = "峙峩峽峺峭嶌峪崋崕崗嵜崟崛崑崔崢崚崙崘嵌嵒嵎嵋嵬嵳嵶嶇嶄嶂嶢嶝嶬",
		"Line 19" = "嶮嶽嶐嶷嶼巉巍巓巒巖巛巫已巵帋帚帙帑帛帶帷幄幃幀幎幗幔幟幢幤幇幵",
		"Line 20" = "并幺麼广庠廁廂廈廐廏廖廣廝廚廛廢廡廨廩廬廱廳廰廴廸廾弃弉彝彜弋弑",
		"Line 21" = "弖弩弭弸彁彈彌彎弯彑彖彗彡彭彳彷徃徂彿徊很徑徇從徙徘徠徨徭徼忖忻",
		"Line 22" = "忤忸忱忝悳忿怡恠怙怐怩怎怱怛怕怫怦怏怺恚恁恪恷恟恊恆恍恃恤恂恬恫",
		"Line 23" = "恙悁悍悃悚悄悛悖悗悒悧悋惡悸惠惓悴忰悽惆悵惘慍愕愆惶惷愀惴惺愃愡",
		"Line 24" = "惻惱愍愎慇愾愨愧慊愿愼愬愴愽慂慳慷慘慙慚慫慴慯慥慱慟慝慓慵憙憖憇",
		"Line 25" = "憔憚憊憑憫憮懌懊應懷懈懃懆憺懋罹懍懦懣懶懺懴懿懽懼懾戀戈戉戍戌戔",
		"Line 26" = "戛戞戡截戮戰戲戳扁扎扞扣扛扠扨扼抂抉找抒抓抖拔抃抔拗拑抻拏拿拆擔",
		"Line 27" = "拈拜拌拊拂拇抛挌拮拱挧挂挈拯拵捐挾捍搜捏掖掎掀掫捶掣掏掉掟掵捫捩",
		"Line 28" = "掾揩揀揆揣揉插揶揄搖搴搆搓搦搶攝搗搨搏摧摶摎攪撕撓撥撩撈撼據擒擅",
		"Line 29" = "擇撻擘擂擱擧舉擠擡抬擣擯攬擶擴擲擺攀擽攘攜攅攤攣攫攴攵攷收攸畋效",
		"Line 30" = "敖敕敍敘敞敝敲數斂斃變斛斟斫斷旃旆旁旄旌旒旛旙无旡旱杲昊昃旻杳昵",
		"Line 31" = "昶昴昜晏晄晉晁晞晝晤晧晨晟晢晰暃暈暎暉暄暘暝曁暹曉暾暼曄暸曚曠昿",
	},
	"kanji-jis2 2": {
		"Line  0" = "曦曩曰曵曷朏朖朞朦朧霸朮朿朶杁朸朷杆杞杠杙杣杤枉杰枩杼杪枌枋枦枡",
		"Line  1" = "枅枷柯枴柬枳柩枸柤柞柝柢柮枹柎柆柧檜栞框栩桀桍栲桎梳栫桙档桷桿梟",
		"Line  2" = "梏梭梔條梛梃檮梹桴梵梠梺椏梍桾椁棊椈棘椢椦棡椌棍棔棧棕椶椒椄棗棣",
		"Line  3" = "椥棹棠棯椨椪椚椣椡棆楹楜楸楫楔楾楮椹楴椽楙椰楡楞楝榁楪榲榮槐榿槁",
		"Line  4" = "槓榾槎寨槊槝榻槃榧樮榑榠榜榕榴槞槨樂樛槿權槹槲槧樅榱樞槭樔槫樊樒",
		"Line  5" = "櫁樣樓橄樌橲樶橸橇橢橙橦橈樸樢檐檍檠檄檢檣檗蘗檻櫃櫂檸檳檬櫞櫑櫟",
		"Line  6" = "檪櫚櫪櫻欅蘖櫺欒欖欟欸欷盜欹飮歇歃歉歐歙歔歛歟歡歸歹歿殀殄殃殍殘",
		"Line  7" = "殕殞殤殪殫殯殲殱殳殷殼毆毋毓毟毬毫毳毯麾氈氓气氛氤氣汞汕汢汪沂沍",
		"Line  8" = "沚沁沛汾汨汳沒沐泄泱泓沽泗泅泝沮沱沾沺泛泯泙泪洟衍洶洫洽洸洙洵洳",
		"Line  9" = "洒洌浣涓浤浚浹浙涎涕濤涅淹渕渊涵淇淦涸淆淬淞淌淨淒淅淺淙淤淕淪淮",
		"Line 10" = "渭湮渮渙湲湟渾渣湫渫湶湍渟湃渺湎渤滿渝游溂溪溘滉溷滓溽溯滄溲滔滕",
		"Line 11" = "溏溥滂溟潁漑灌滬滸滾漿滲漱滯漲滌漾漓滷澆潺潸澁澀潯潛濳潭澂潼潘澎",
		"Line 12" = "澑濂潦澳澣澡澤澹濆澪濟濕濬濔濘濱濮濛瀉瀋濺瀑瀁瀏濾瀛瀚潴瀝瀘瀟瀰",
		"Line 13" = "瀾瀲灑灣炙炒炯烱炬炸炳炮烟烋烝烙焉烽焜焙煥煕熈煦煢煌煖煬熏燻熄熕",
		"Line 14" = "熨熬燗熹熾燒燉燔燎燠燬燧燵燼燹燿爍爐爛爨爭爬爰爲爻爼爿牀牆牋牘牴",
		"Line 15" = "牾犂犁犇犒犖犢犧犹犲狃狆狄狎狒狢狠狡狹狷倏猗猊猜猖猝猴猯猩猥猾獎",
		"Line 16" = "獏默獗獪獨獰獸獵獻獺珈玳珎玻珀珥珮珞璢琅瑯琥珸琲琺瑕琿瑟瑙瑁瑜瑩",
		"Line 17" = "瑰瑣瑪瑶瑾璋璞瓊瓏瓔珱瓠瓣瓧瓩瓮瓲瓰瓱瓸瓷甄甃甅甌甎甍甕甓甞甦甬",
		"Line 18" = "甼畄畍畊畉畛畆畚畩畤畧畫畭畸當疆疇畴疊疉疂疔疚疝疥疣痂疳痃疵疽疸",
		"Line 19" = "疼疱痍痊痒痙痣痞痾痿痼瘁痰痺痲痳瘋瘉瘟瘧瘠瘡瘢瘤瘴瘰瘻癇癈癆癜癘",
		"Line 20" = "癡癢癨癩癪癧癬癰癲癶癸發皀皃皈皋皎皖皓皙皚皰皴皸皹皺盂盍盖盒盞盡",
		"Line 21" = "盥盧盪蘯盻眈眇眄眩眤眞眥眦眛眷眸睇睚睨睫睛睥睿睾睹瞎瞋瞑瞠瞞瞰瞶",
		"Line 22" = "瞹瞿瞼瞽瞻矇矍矗矚矜矣矮矼砌砒礦砠礪硅碎硴碆硼碚碌碣碵碪碯磑磆磋",
		"Line 23" = "磔碾碼磅磊磬磧磚磽磴礇礒礑礙礬礫祀祠祗祟祚祕祓祺祿禊禝禧齋禪禮禳",
		"Line 24" = "禹禺秉秕秧秬秡秣稈稍稘稙稠稟禀稱稻稾稷穃穗穉穡穢穩龝穰穹穽窈窗窕",
		"Line 25" = "窘窖窩竈窰窶竅竄窿邃竇竊竍竏竕竓站竚竝竡竢竦竭竰笂笏笊笆笳笘笙笞",
		"Line 26" = "笵笨笶筐筺笄筍笋筌筅筵筥筴筧筰筱筬筮箝箘箟箍箜箚箒箏筝箙篋篁篌篏",
		"Line 27" = "箴篆篝篩簑簔篦篥簀簇簓篳篷簗簍篶簣簧簪簟簷簫簽籌籃籔籏籀籐籘籟籤",
		"Line 28" = "籖籥籬籵粃粐粤粭粢粫粡粨粳粲粱粮粹粽糀糅糂糘糒糜糢鬻糯糲糴糶糺紆",
		"Line 29" = "紂紜紕紊絅絋紮紲紿紵絆絳絖絎絲絨絮絏絣經綉絛綏絽綛綺綮綣綵緇綽綫",
		"Line 30" = "總綢綯緜綸綟綰緘緝緤緞緲緡縅縊縣縡縒縱縟縉縋縢繆繦縻縵縹繃縷縲縺",
		"Line 31" = "繧繝繖繞繙繚繹繪繩繼繻纃緕繽辮繿纈纉續纒纐纓纔纖纎纛纜缸缺罅罌罍",
	},
	"kanji-jis2 3": {
		"Line  0" = "罎罐网罕罔罘罟罠罨罩罧罸羂羆羃羈羇羌羔羝羚羣羯羲羹羮羶羸譱翅翆翊",
		"Line  1" = "翕翔翡翦翩翳翹飜耆耄耋耒耘耙耜耡耨耿耻聊聆聒聘聚聟聢聨聳聲聰聶聹",
		"Line  2" = "聽聿肄肆肅肛肓肚肭冐肬胛胥胙胝胄胚胖脉胯胱脛脩脣脯腋隋腆脾腓腑胼",
		"Line  3" = "腱腮腥腦腴膃膈膊膀膂膠膕膤膣腟膓膩膰膵膾膸膽臀臂膺臉臍臑臙臘臈臚",
		"Line  4" = "臟臠臧臺臻臾舁舂舅與舊舍舐舖舩舫舸舳艀艙艘艝艚艟艤艢艨艪艫舮艱艷",
		"Line  5" = "艸艾芍芒芫芟芻芬苡苣苟苒苴苳苺莓范苻苹苞茆苜茉苙茵茴茖茲茱荀茹荐",
		"Line  6" = "荅茯茫茗茘莅莚莪莟莢莖茣莎莇莊荼莵荳荵莠莉莨菴萓菫菎菽萃菘萋菁菷",
		"Line  7" = "萇菠菲萍萢萠莽萸蔆菻葭萪萼蕚蒄葷葫蒭葮蒂葩葆萬葯葹萵蓊葢蒹蒿蒟蓙",
		"Line  8" = "蓍蒻蓚蓐蓁蓆蓖蒡蔡蓿蓴蔗蔘蔬蔟蔕蔔蓼蕀蕣蕘蕈蕁蘂蕋蕕薀薤薈薑薊薨",
		"Line  9" = "蕭薔薛藪薇薜蕷蕾薐藉薺藏薹藐藕藝藥藜藹蘊蘓蘋藾藺蘆蘢蘚蘰蘿虍乕虔",
		"Line 10" = "號虧虱蚓蚣蚩蚪蚋蚌蚶蚯蛄蛆蚰蛉蠣蚫蛔蛞蛩蛬蛟蛛蛯蜒蜆蜈蜀蜃蛻蜑蜉",
		"Line 11" = "蜍蛹蜊蜴蜿蜷蜻蜥蜩蜚蝠蝟蝸蝌蝎蝴蝗蝨蝮蝙蝓蝣蝪蠅螢螟螂螯蟋螽蟀蟐",
		"Line 12" = "雖螫蟄螳蟇蟆螻蟯蟲蟠蠏蠍蟾蟶蟷蠎蟒蠑蠖蠕蠢蠡蠱蠶蠹蠧蠻衄衂衒衙衞",
		"Line 13" = "衢衫袁衾袞衵衽袵衲袂袗袒袮袙袢袍袤袰袿袱裃裄裔裘裙裝裹褂裼裴裨裲",
		"Line 14" = "褄褌褊褓襃褞褥褪褫襁襄褻褶褸襌褝襠襞襦襤襭襪襯襴襷襾覃覈覊覓覘覡",
		"Line 15" = "覩覦覬覯覲覺覽覿觀觚觜觝觧觴觸訖訐訌訛訝訥訶詁詛詒詆詈詼詭詬詢誅",
		"Line 16" = "誂誄誨誡誑誥誦誚誣諄諍諂諚諫諳諤諱謔諠諢諷諞諛謌謇謚諡謖謐謗謠謳",
		"Line 17" = "鞫謦謫謾謨譁譌譏譎證譖譛譚譫譟譬譯譴譽讀讌讎讒讓讖讙讚谺豁谿豈豌",
		"Line 18" = "豎豐豕豢豬豸豺貂貉貅貊貍貎貔豼貘戝貭貽貲貳貮貶賈賁賤賣賚賽賺賻贄",
		"Line 19" = "贅贊贇贏贍贐齎贓賍贔贖赧赭赱赳趁趙跂趾趺跏跚跖跌跛跋跪跫跟跣跼踈",
		"Line 20" = "踉跿踝踞踐踟蹂踵踰踴蹊蹇蹉蹌蹐蹈蹙蹤蹠蹣蹕蹶蹲蹼躁躇躅躄躋躊躓躑",
		"Line 21" = "躔躙躪躡躬躰軆躱躾軅軈軋軛軣軼軻軫軾輊輅輕輒輙輓輜輟輛輌輦輳輻輹",
		"Line 22" = "轅轂輾轌轉轆轎轗轜轢轣轤辜辟辭辯辷迚迥迢迪迯邇迴逅迹迺逑逕逡逍逞",
		"Line 23" = "逖逋逧逶逵逹迸遏遐遑遒逎遉逾遖遘遞遨遯遶隨遲邂遽邁邀邊邉邏邨邯邱",
		"Line 24" = "邵郢郤扈郛鄂鄒鄙鄲鄰酊酖酘酣酥酩酳酲醋醉醂醢醫醯醪醵醴醺釀釁釉釋",
		"Line 25" = "釐釖釟釡釛釼釵釶鈞釿鈔鈬鈕鈑鉞鉗鉅鉉鉤鉈銕鈿鉋鉐銜銖銓銛鉚鋏銹銷",
		"Line 26" = "鋩錏鋺鍄錙錢錚錣錺錵錻鍜鍠鍼鍮鍖鎰鎬鎭鎔鎹鏖鏗鏨鏥鏘鏃鏝鏐鏈鏤鐚",
		"Line 27" = "鐔鐓鐃鐇鐐鐶鐫鐵鐡鐺鑁鑒鑄鑛鑠鑢鑞鑪鈩鑰鑵鑷鑽鑚鑼鑾钁鑿閂閇閊閔",
		"Line 28" = "閖閘閙閠閨閧閭閼閻閹閾闊濶闃闍闌闕闔闖關闡闥闢阡阨阮阯陂陌陏陋陷",
		"Line 29" = "陜陞陝陟陦陲陬隍隘隕隗險隧隱隲隰隴隶隸隹雎雋雉雍襍雜霍雕雹霄霆霈",
		"Line 30" = "霓霎霑霏霖霙霤霪霰霹霽霾靄靆靈靂靉靜靠靤靦靨勒靫靱靹鞅靼鞁靺鞆鞋",
		"Line 31" = "鞏鞐鞜鞨鞦鞣鞳鞴韃韆韈韋韜韭齏韲竟韶韵頏頌頸頤頡頷頽顆顏顋顫顯顰",
	},
	"kanji-jis2 4": {
		"Line 0" = "顱顴顳颪颯颱颶飄飃飆飩飫餃餉餒餔餘餡餝餞餤餠餬餮餽餾饂饉饅饐饋饑",
		"Line 1" = "饒饌饕馗馘馥馭馮馼駟駛駝駘駑駭駮駱駲駻駸騁騏騅駢騙騫騷驅驂驀驃騾",
		"Line 2" = "驕驍驛驗驟驢驥驤驩驫驪骭骰骼髀髏髑髓體髞髟髢髣髦髯髫髮髴髱髷髻鬆",
		"Line 3" = "鬘鬚鬟鬢鬣鬥鬧鬨鬩鬪鬮鬯鬲魄魃魏魍魎魑魘魴鮓鮃鮑鮖鮗鮟鮠鮨鮴鯀鯊",
		"Line 4" = "鮹鯆鯏鯑鯒鯣鯢鯤鯔鯡鰺鯲鯱鯰鰕鰔鰉鰓鰌鰆鰈鰒鰊鰄鰮鰛鰥鰤鰡鰰鱇鰲",
		"Line 5" = "鱆鰾鱚鱠鱧鱶鱸鳧鳬鳰鴉鴈鳫鴃鴆鴪鴦鶯鴣鴟鵄鴕鴒鵁鴿鴾鵆鵈鵝鵞鵤鵑",
		"Line 6" = "鵐鵙鵲鶉鶇鶫鵯鵺鶚鶤鶩鶲鷄鷁鶻鶸鶺鷆鷏鷂鷙鷓鷸鷦鷭鷯鷽鸚鸛鸞鹵鹹",
		"Line 7" = "鹽麁麈麋麌麒麕麑麝麥麩麸麪麭靡黌黎黏黐黔黜點黝黠黥黨黯黴黶黷黹黻",
		"Line 8" = "黼黽鼇鼈皷鼕鼡鼬鼾齊齒齔齣齟齠齡齦齧齬齪齷齲齶龕龜龠堯槇遙瑤凜熙",
	},
	"kanji-ibm": {
		"Line  0" = "纊褜鍈銈蓜俉炻昱棈鋹曻彅丨仡仼伀伃伹佖侒侊侚侔俍偀倢俿倞偆偰偂傔",
		"Line  1" = "僴僘兊兤冝冾凬刕劜劦勀勛匀匇匤卲厓厲叝﨎咜咊咩哿喆坙坥垬埈埇﨏塚",
		"Line  2" = "增墲夋奓奛奝奣妤妺孖寀甯寘寬尞岦岺峵崧嵓﨑嵂嵭嶸嶹巐弡弴彧德忞恝",
		"Line  3" = "悅悊惞惕愠惲愑愷愰憘戓抦揵摠撝擎敎昀昕昻昉昮昞昤晥晗晙晴晳暙暠暲",
		"Line  4" = "暿曺朎朗杦枻桒柀栁桄棏﨓楨﨔榘槢樰橫橆橳橾櫢櫤毖氿汜沆汯泚洄涇浯",
		"Line  5" = "涖涬淏淸淲淼渹湜渧渼溿澈澵濵瀅瀇瀨炅炫焏焄煜煆煇凞燁燾犱犾猤猪獷",
		"Line  6" = "玽珉珖珣珒琇珵琦琪琩琮瑢璉璟甁畯皂皜皞皛皦益睆劯砡硎硤硺礰礼神祥",
		"Line  7" = "禔福禛竑竧靖竫箞精絈絜綷綠緖繒罇羡羽茁荢荿菇菶葈蒴蕓蕙蕫﨟薰蘒﨡",
		"Line  8" = "蠇裵訒訷詹誧誾諟諸諶譓譿賰賴贒赶﨣軏﨤逸遧郞都鄕鄧釚釗釞釭釮釤釥",
		"Line  9" = "鈆鈐鈊鈺鉀鈼鉎鉙鉑鈹鉧銧鉷鉸鋧鋗鋙鋐﨧鋕鋠鋓錥錡鋻﨨錞鋿錝錂鍰鍗",
		"Line 10" = "鎤鏆鏞鏸鐱鑅鑈閒隆﨩隝隯霳霻靃靍靏靑靕顗顥飯飼餧館馞驎髙髜魵魲鮏",
		"Line 11" = "鮱鮻鰀鵰鵫鶴鸙黑",
	},
	"compatible": {
		"Line 0" = "￣―－～",
		"Line 1" = "¥￠￡￢",
	},
	"Jamo01": {
		"Line  0" = "가각갂갃간갅갆갇갈갉갊갋갌갍갎갏감갑값갓갔강갖갗",
		"Line  1" = "갘같갚갛개객갞갟갠갡갢갣갤갥갦갧갨갩갪갫갬갭갮갯",
		"Line  2" = "갰갱갲갳갴갵갶갷갸갹갺갻갼갽갾갿걀걁걂걃걄걅걆걇",
		"Line  3" = "걈걉걊걋걌걍걎걏걐걑걒걓걔걕걖걗걘걙걚걛걜걝걞걟",
		"Line  4" = "걠걡걢걣걤걥걦걧걨걩걪걫걬걭걮걯거걱걲걳건걵걶걷",
		"Line  5" = "걸걹걺걻걼걽걾걿검겁겂것겄겅겆겇겈겉겊겋게겍겎겏",
		"Line  6" = "겐겑겒겓겔겕겖겗겘겙겚겛겜겝겞겟겠겡겢겣겤겥겦겧",
		"Line  7" = "겨격겪겫견겭겮겯결겱겲겳겴겵겶겷겸겹겺겻겼경겾겿",
		"Line  8" = "곀곁곂곃계곅곆곇곈곉곊곋곌곍곎곏곐곑곒곓곔곕곖곗",
		"Line  9" = "곘곙곚곛곜곝곞곟고곡곢곣곤곥곦곧골곩곪곫곬곭곮곯",
		"Line 10" = "곰곱곲곳곴공곶곷곸곹곺곻과곽곾곿관괁괂괃괄괅괆괇",
		"Line 11" = "괈괉괊괋괌괍괎괏괐광괒괓괔괕괖괗괘괙괚괛괜괝괞괟",
		"Line 12" = "괠괡괢괣괤괥괦괧괨괩괪괫괬괭괮괯괰괱괲괳괴괵괶괷",
		"Line 13" = "괸괹괺괻괼괽괾괿굀굁굂굃굄굅굆굇굈굉굊굋굌굍굎굏",
		"Line 14" = "교굑굒굓굔굕굖굗굘굙굚굛굜굝굞굟굠굡굢굣굤굥굦굧",
		"Line 15" = "굨굩굪굫구국굮굯군굱굲굳굴굵굶굷굸굹굺굻굼굽굾굿",
		"Line 16" = "궀궁궂궃궄궅궆궇궈궉궊궋권궍궎궏궐궑궒궓궔궕궖궗",
		"Line 17" = "궘궙궚궛궜궝궞궟궠궡궢궣궤궥궦궧궨궩궪궫궬궭궮궯",
		"Line 18" = "궰궱궲궳궴궵궶궷궸궹궺궻궼궽궾궿귀귁귂귃귄귅귆귇",
		"Line 19" = "귈귉귊귋귌귍귎귏귐귑귒귓귔귕귖귗귘귙귚귛규귝귞귟",
		"Line 20" = "균귡귢귣귤귥귦귧귨귩귪귫귬귭귮귯귰귱귲귳귴귵귶귷",
		"Line 21" = "그극귺귻근귽귾귿글긁긂긃긄긅긆긇금급긊긋긌긍긎긏",
		"Line 22" = "긐긑긒긓긔긕긖긗긘긙긚긛긜긝긞긟긠긡긢긣긤긥긦긧",
		"Line 23" = "긨긩긪긫긬긭긮긯기긱긲긳긴긵긶긷길긹긺긻긼긽긾긿",
	},
	"Jamo02": {
		"Line  0" = "긿김깁깂깃깄깅깆깇깈깉깊깋까깍깎깏깐깑깒깓깔깕깖",
		"Line  1" = "깗깘깙깚깛깜깝깞깟깠깡깢깣깤깥깦깧깨깩깪깫깬깭깮",
		"Line  2" = "깯깰깱깲깳깴깵깶깷깸깹깺깻깼깽깾깿꺀꺁꺂꺃꺄꺅꺆",
		"Line  3" = "꺇꺈꺉꺊꺋꺌꺍꺎꺏꺐꺑꺒꺓꺔꺕꺖꺗꺘꺙꺚꺛꺜꺝꺞",
		"Line  4" = "꺟꺠꺡꺢꺣꺤꺥꺦꺧꺨꺩꺪꺫꺬꺭꺮꺯꺰꺱꺲꺳꺴꺵꺶",
		"Line  5" = "꺷꺸꺹꺺꺻꺼꺽꺾꺿껀껁껂껃껄껅껆껇껈껉껊껋껌껍껎",
		"Line  6" = "껏껐껑껒껓껔껕껖껗께껙껚껛껜껝껞껟껠껡껢껣껤껥껦",
		"Line  7" = "껧껨껩껪껫껬껭껮껯껰껱껲껳껴껵껶껷껸껹껺껻껼껽껾",
		"Line  8" = "껿꼀꼁꼂꼃꼄꼅꼆꼇꼈꼉꼊꼋꼌꼍꼎꼏꼐꼑꼒꼓꼔꼕꼖",
		"Line  9" = "꼗꼘꼙꼚꼛꼜꼝꼞꼟꼠꼡꼢꼣꼤꼥꼦꼧꼨꼩꼪꼫꼬꼭꼮",
		"Line 10" = "꼯꼰꼱꼲꼳꼴꼵꼶꼷꼸꼹꼺꼻꼼꼽꼾꼿꽀꽁꽂꽃꽄꽅꽆",
		"Line 11" = "꽇꽈꽉꽊꽋꽌꽍꽎꽏꽐꽑꽒꽓꽔꽕꽖꽗꽘꽙꽚꽛꽜꽝꽞",
		"Line 12" = "꽟꽠꽡꽢꽣꽤꽥꽦꽧꽨꽩꽪꽫꽬꽭꽮꽯꽰꽱꽲꽳꽴꽵꽶",
		"Line 13" = "꽷꽸꽹꽺꽻꽼꽽꽾꽿꾀꾁꾂꾃꾄꾅꾆꾇꾈꾉꾊꾋꾌꾍꾎",
		"Line 14" = "꾏꾐꾑꾒꾓꾔꾕꾖꾗꾘꾙꾚꾛꾜꾝꾞꾟꾠꾡꾢꾣꾤꾥꾦",
		"Line 15" = "꾧꾨꾩꾪꾫꾬꾭꾮꾯꾰꾱꾲꾳꾴꾵꾶꾷꾸꾹꾺꾻꾼꾽꾾",
		"Line 16" = "꾿꿀꿁꿂꿃꿄꿅꿆꿇꿈꿉꿊꿋꿌꿍꿎꿏꿐꿑꿒꿓꿔꿕꿖",
		"Line 17" = "꿗꿘꿙꿚꿛꿜꿝꿞꿟꿠꿡꿢꿣꿤꿥꿦꿧꿨꿩꿪꿫꿬꿭꿮",
		"Line 18" = "꿯꿰꿱꿲꿳꿴꿵꿶꿷꿸꿹꿺꿻꿼꿽꿾꿿뀀뀁뀂뀃뀄뀅뀆",
		"Line 19" = "뀇뀈뀉뀊뀋뀌뀍뀎뀏뀐뀑뀒뀓뀔뀕뀖뀗뀘뀙뀚뀛뀜뀝뀞",
		"Line 20" = "뀟뀠뀡뀢뀣뀤뀥뀦뀧뀨뀩뀪뀫뀬뀭뀮뀯뀰뀱뀲뀳뀴뀵뀶",
		"Line 21" = "뀷뀸뀹뀺뀻뀼뀽뀾뀿끀끁끂끃끄끅끆끇끈끉끊끋끌끍끎",
		"Line 22" = "끏끐끑끒끓끔끕끖끗끘끙끚끛끜끝끞끟끠끡끢끣끤끥끦",
		"Line 23" = "끧끨끩끪끫끬끭끮끯끰끱끲끳끴끵끶끷끸끹끺끻끼끽끾",
	},
	"Jamo03": {
		"Line  0" = "끾끿낀낁낂낃낄낅낆낇낈낉낊낋낌낍낎낏낐낑낒낓낔낕",
		"Line  1" = "낖낗나낙낚낛난낝낞낟날낡낢낣낤낥낦낧남납낪낫났낭",
		"Line  2" = "낮낯낰낱낲낳내낵낶낷낸낹낺낻낼낽낾낿냀냁냂냃냄냅",
		"Line  3" = "냆냇냈냉냊냋냌냍냎냏냐냑냒냓냔냕냖냗냘냙냚냛냜냝",
		"Line  4" = "냞냟냠냡냢냣냤냥냦냧냨냩냪냫냬냭냮냯냰냱냲냳냴냵",
		"Line  5" = "냶냷냸냹냺냻냼냽냾냿넀넁넂넃넄넅넆넇너넉넊넋넌넍",
		"Line  6" = "넎넏널넑넒넓넔넕넖넗넘넙넚넛넜넝넞넟넠넡넢넣네넥",
		"Line  7" = "넦넧넨넩넪넫넬넭넮넯넰넱넲넳넴넵넶넷넸넹넺넻넼넽",
		"Line  8" = "넾넿녀녁녂녃년녅녆녇녈녉녊녋녌녍녎녏념녑녒녓녔녕",
		"Line  9" = "녖녗녘녙녚녛녜녝녞녟녠녡녢녣녤녥녦녧녨녩녪녫녬녭",
		"Line 10" = "녮녯녰녱녲녳녴녵녶녷노녹녺녻논녽녾녿놀놁놂놃놄놅",
		"Line 11" = "놆놇놈놉놊놋놌농놎놏놐놑높놓놔놕놖놗놘놙놚놛놜놝",
		"Line 12" = "놞놟놠놡놢놣놤놥놦놧놨놩놪놫놬놭놮놯놰놱놲놳놴놵",
		"Line 13" = "놶놷놸놹놺놻놼놽놾놿뇀뇁뇂뇃뇄뇅뇆뇇뇈뇉뇊뇋뇌뇍",
		"Line 14" = "뇎뇏뇐뇑뇒뇓뇔뇕뇖뇗뇘뇙뇚뇛뇜뇝뇞뇟뇠뇡뇢뇣뇤뇥",
		"Line 15" = "뇦뇧뇨뇩뇪뇫뇬뇭뇮뇯뇰뇱뇲뇳뇴뇵뇶뇷뇸뇹뇺뇻뇼뇽",
		"Line 16" = "뇾뇿눀눁눂눃누눅눆눇눈눉눊눋눌눍눎눏눐눑눒눓눔눕",
		"Line 17" = "눖눗눘눙눚눛눜눝눞눟눠눡눢눣눤눥눦눧눨눩눪눫눬눭",
		"Line 18" = "눮눯눰눱눲눳눴눵눶눷눸눹눺눻눼눽눾눿뉀뉁뉂뉃뉄뉅",
		"Line 19" = "뉆뉇뉈뉉뉊뉋뉌뉍뉎뉏뉐뉑뉒뉓뉔뉕뉖뉗뉘뉙뉚뉛뉜뉝",
		"Line 20" = "뉞뉟뉠뉡뉢뉣뉤뉥뉦뉧뉨뉩뉪뉫뉬뉭뉮뉯뉰뉱뉲뉳뉴뉵",
		"Line 21" = "뉶뉷뉸뉹뉺뉻뉼뉽뉾뉿늀늁늂늃늄늅늆늇늈늉늊늋늌늍",
		"Line 22" = "늎늏느늑늒늓는늕늖늗늘늙늚늛늜늝늞늟늠늡늢늣늤능",
		"Line 23" = "늦늧늨늩늪늫늬늭늮늯늰늱늲늳늴늵늶늷늸늹늺늻늼늽",
	},
	"Jamo04": {
		"Line  0" = "늽늾늿닀닁닂닃닄닅닆닇니닉닊닋닌닍닎닏닐닑닒닓닔",
		"Line  1" = "닕닖닗님닙닚닛닜닝닞닟닠닡닢닣다닥닦닧단닩닪닫달",
		"Line  2" = "닭닮닯닰닱닲닳담답닶닷닸당닺닻닼닽닾닿대댁댂댃댄",
		"Line  3" = "댅댆댇댈댉댊댋댌댍댎댏댐댑댒댓댔댕댖댗댘댙댚댛댜",
		"Line  4" = "댝댞댟댠댡댢댣댤댥댦댧댨댩댪댫댬댭댮댯댰댱댲댳댴",
		"Line  5" = "댵댶댷댸댹댺댻댼댽댾댿덀덁덂덃덄덅덆덇덈덉덊덋덌",
		"Line  6" = "덍덎덏덐덑덒덓더덕덖덗던덙덚덛덜덝덞덟덠덡덢덣덤",
		"Line  7" = "덥덦덧덨덩덪덫덬덭덮덯데덱덲덳덴덵덶덷델덹덺덻덼",
		"Line  8" = "덽덾덿뎀뎁뎂뎃뎄뎅뎆뎇뎈뎉뎊뎋뎌뎍뎎뎏뎐뎑뎒뎓뎔",
		"Line  9" = "뎕뎖뎗뎘뎙뎚뎛뎜뎝뎞뎟뎠뎡뎢뎣뎤뎥뎦뎧뎨뎩뎪뎫뎬",
		"Line 10" = "뎭뎮뎯뎰뎱뎲뎳뎴뎵뎶뎷뎸뎹뎺뎻뎼뎽뎾뎿돀돁돂돃도",
		"Line 11" = "독돆돇돈돉돊돋돌돍돎돏돐돑돒돓돔돕돖돗돘동돚돛돜",
		"Line 12" = "돝돞돟돠돡돢돣돤돥돦돧돨돩돪돫돬돭돮돯돰돱돲돳돴",
		"Line 13" = "돵돶돷돸돹돺돻돼돽돾돿됀됁됂됃됄됅됆됇됈됉됊됋됌",
		"Line 14" = "됍됎됏됐됑됒됓됔됕됖됗되됙됚됛된됝됞됟될됡됢됣됤",
		"Line 15" = "됥됦됧됨됩됪됫됬됭됮됯됰됱됲됳됴됵됶됷됸됹됺됻됼",
		"Line 16" = "됽됾됿둀둁둂둃둄둅둆둇둈둉둊둋둌둍둎둏두둑둒둓둔",
		"Line 17" = "둕둖둗둘둙둚둛둜둝둞둟둠둡둢둣둤둥둦둧둨둩둪둫둬",
		"Line 18" = "둭둮둯둰둱둲둳둴둵둶둷둸둹둺둻둼둽둾둿뒀뒁뒂뒃뒄",
		"Line 19" = "뒅뒆뒇뒈뒉뒊뒋뒌뒍뒎뒏뒐뒑뒒뒓뒔뒕뒖뒗뒘뒙뒚뒛뒜",
		"Line 20" = "뒝뒞뒟뒠뒡뒢뒣뒤뒥뒦뒧뒨뒩뒪뒫뒬뒭뒮뒯뒰뒱뒲뒳뒴",
		"Line 21" = "뒵뒶뒷뒸뒹뒺뒻뒼뒽뒾뒿듀듁듂듃듄듅듆듇듈듉듊듋듌",
		"Line 22" = "듍듎듏듐듑듒듓듔듕듖듗듘듙듚듛드득듞듟든듡듢듣들",
		"Line 23" = "듥듦듧듨듩듪듫듬듭듮듯듰등듲듳듴듵듶듷듸듹듺듻듼",
	},
	"Jamo05": {
		"Line  0" = "듼듽듾듿딀딁딂딃딄딅딆딇딈딉딊딋딌딍딎딏딐딑딒딓",
		"Line  1" = "디딕딖딗딘딙딚딛딜딝딞딟딠딡딢딣딤딥딦딧딨딩딪딫",
		"Line  2" = "딬딭딮딯따딱딲딳딴딵딶딷딸딹딺딻딼딽딾딿땀땁땂땃",
		"Line  3" = "땄땅땆땇땈땉땊땋때땍땎땏땐땑땒땓땔땕땖땗땘땙땚땛",
		"Line  4" = "땜땝땞땟땠땡땢땣땤땥땦땧땨땩땪땫땬땭땮땯땰땱땲땳",
		"Line  5" = "땴땵땶땷땸땹땺땻땼땽땾땿떀떁떂떃떄떅떆떇떈떉떊떋",
		"Line  6" = "떌떍떎떏떐떑떒떓떔떕떖떗떘떙떚떛떜떝떞떟떠떡떢떣",
		"Line  7" = "떤떥떦떧떨떩떪떫떬떭떮떯떰떱떲떳떴떵떶떷떸떹떺떻",
		"Line  8" = "떼떽떾떿뗀뗁뗂뗃뗄뗅뗆뗇뗈뗉뗊뗋뗌뗍뗎뗏뗐뗑뗒뗓",
		"Line  9" = "뗔뗕뗖뗗뗘뗙뗚뗛뗜뗝뗞뗟뗠뗡뗢뗣뗤뗥뗦뗧뗨뗩뗪뗫",
		"Line 10" = "뗬뗭뗮뗯뗰뗱뗲뗳뗴뗵뗶뗷뗸뗹뗺뗻뗼뗽뗾뗿똀똁똂똃",
		"Line 11" = "똄똅똆똇똈똉똊똋똌똍똎똏또똑똒똓똔똕똖똗똘똙똚똛",
		"Line 12" = "똜똝똞똟똠똡똢똣똤똥똦똧똨똩똪똫똬똭똮똯똰똱똲똳",
		"Line 13" = "똴똵똶똷똸똹똺똻똼똽똾똿뙀뙁뙂뙃뙄뙅뙆뙇뙈뙉뙊뙋",
		"Line 14" = "뙌뙍뙎뙏뙐뙑뙒뙓뙔뙕뙖뙗뙘뙙뙚뙛뙜뙝뙞뙟뙠뙡뙢뙣",
		"Line 15" = "뙤뙥뙦뙧뙨뙩뙪뙫뙬뙭뙮뙯뙰뙱뙲뙳뙴뙵뙶뙷뙸뙹뙺뙻",
		"Line 16" = "뙼뙽뙾뙿뚀뚁뚂뚃뚄뚅뚆뚇뚈뚉뚊뚋뚌뚍뚎뚏뚐뚑뚒뚓",
		"Line 17" = "뚔뚕뚖뚗뚘뚙뚚뚛뚜뚝뚞뚟뚠뚡뚢뚣뚤뚥뚦뚧뚨뚩뚪뚫",
		"Line 18" = "뚬뚭뚮뚯뚰뚱뚲뚳뚴뚵뚶뚷뚸뚹뚺뚻뚼뚽뚾뚿뛀뛁뛂뛃",
		"Line 19" = "뛄뛅뛆뛇뛈뛉뛊뛋뛌뛍뛎뛏뛐뛑뛒뛓뛔뛕뛖뛗뛘뛙뛚뛛",
		"Line 20" = "뛜뛝뛞뛟뛠뛡뛢뛣뛤뛥뛦뛧뛨뛩뛪뛫뛬뛭뛮뛯뛰뛱뛲뛳",
		"Line 21" = "뛴뛵뛶뛷뛸뛹뛺뛻뛼뛽뛾뛿뜀뜁뜂뜃뜄뜅뜆뜇뜈뜉뜊뜋",
		"Line 22" = "뜌뜍뜎뜏뜐뜑뜒뜓뜔뜕뜖뜗뜘뜙뜚뜛뜜뜝뜞뜟뜠뜡뜢뜣",
		"Line 23" = "뜤뜥뜦뜧뜨뜩뜪뜫뜬뜭뜮뜯뜰뜱뜲뜳뜴뜵뜶뜷뜸뜹뜺뜻",
	},
	"Jamo06": {
		"Line  0" = "뜻뜼뜽뜾뜿띀띁띂띃띄띅띆띇띈띉띊띋띌띍띎띏띐띑띒",
		"Line  1" = "띓띔띕띖띗띘띙띚띛띜띝띞띟띠띡띢띣띤띥띦띧띨띩띪",
		"Line  2" = "띫띬띭띮띯띰띱띲띳띴띵띶띷띸띹띺띻라락띾띿란랁랂",
		"Line  3" = "랃랄랅랆랇랈랉랊랋람랍랎랏랐랑랒랓랔랕랖랗래랙랚",
		"Line  4" = "랛랜랝랞랟랠랡랢랣랤랥랦랧램랩랪랫랬랭랮랯랰랱랲",
		"Line  5" = "랳랴략랶랷랸랹랺랻랼랽랾랿럀럁럂럃럄럅럆럇럈량럊",
		"Line  6" = "럋럌럍럎럏럐럑럒럓럔럕럖럗럘럙럚럛럜럝럞럟럠럡럢",
		"Line  7" = "럣럤럥럦럧럨럩럪럫러럭럮럯런럱럲럳럴럵럶럷럸럹럺",
		"Line  8" = "럻럼럽럾럿렀렁렂렃렄렅렆렇레렉렊렋렌렍렎렏렐렑렒",
		"Line  9" = "렓렔렕렖렗렘렙렚렛렜렝렞렟렠렡렢렣려력렦렧련렩렪",
		"Line 10" = "렫렬렭렮렯렰렱렲렳렴렵렶렷렸령렺렻렼렽렾렿례롁롂",
		"Line 11" = "롃롄롅롆롇롈롉롊롋롌롍롎롏롐롑롒롓롔롕롖롗롘롙롚",
		"Line 12" = "롛로록롞롟론롡롢롣롤롥롦롧롨롩롪롫롬롭롮롯롰롱롲",
		"Line 13" = "롳롴롵롶롷롸롹롺롻롼롽롾롿뢀뢁뢂뢃뢄뢅뢆뢇뢈뢉뢊",
		"Line 14" = "뢋뢌뢍뢎뢏뢐뢑뢒뢓뢔뢕뢖뢗뢘뢙뢚뢛뢜뢝뢞뢟뢠뢡뢢",
		"Line 15" = "뢣뢤뢥뢦뢧뢨뢩뢪뢫뢬뢭뢮뢯뢰뢱뢲뢳뢴뢵뢶뢷뢸뢹뢺",
		"Line 16" = "뢻뢼뢽뢾뢿룀룁룂룃룄룅룆룇룈룉룊룋료룍룎룏룐룑룒",
		"Line 17" = "룓룔룕룖룗룘룙룚룛룜룝룞룟룠룡룢룣룤룥룦룧루룩룪",
		"Line 18" = "룫룬룭룮룯룰룱룲룳룴룵룶룷룸룹룺룻룼룽룾룿뤀뤁뤂",
		"Line 19" = "뤃뤄뤅뤆뤇뤈뤉뤊뤋뤌뤍뤎뤏뤐뤑뤒뤓뤔뤕뤖뤗뤘뤙뤚",
		"Line 20" = "뤛뤜뤝뤞뤟뤠뤡뤢뤣뤤뤥뤦뤧뤨뤩뤪뤫뤬뤭뤮뤯뤰뤱뤲",
		"Line 21" = "뤳뤴뤵뤶뤷뤸뤹뤺뤻뤼뤽뤾뤿륀륁륂륃륄륅륆륇륈륉륊",
		"Line 22" = "륋륌륍륎륏륐륑륒륓륔륕륖륗류륙륚륛륜륝륞륟률륡륢",
		"Line 23" = "륣륤륥륦륧륨륩륪륫륬륭륮륯륰륱륲륳르륵륶륷른륹륺",
	},
	"Jamo07": {
		"Line  0" = "륺륻를륽륾륿릀릁릂릃름릅릆릇릈릉릊릋릌릍릎릏릐릑",
		"Line  1" = "릒릓릔릕릖릗릘릙릚릛릜릝릞릟릠릡릢릣릤릥릦릧릨릩",
		"Line  2" = "릪릫리릭릮릯린릱릲릳릴릵릶릷릸릹릺릻림립릾릿맀링",
		"Line  3" = "맂맃맄맅맆맇마막맊맋만맍많맏말맑맒맓맔맕맖맗맘맙",
		"Line  4" = "맚맛맜망맞맟맠맡맢맣매맥맦맧맨맩맪맫맬맭맮맯맰맱",
		"Line  5" = "맲맳맴맵맶맷맸맹맺맻맼맽맾맿먀먁먂먃먄먅먆먇먈먉",
		"Line  6" = "먊먋먌먍먎먏먐먑먒먓먔먕먖먗먘먙먚먛먜먝먞먟먠먡",
		"Line  7" = "먢먣먤먥먦먧먨먩먪먫먬먭먮먯먰먱먲먳먴먵먶먷머먹",
		"Line  8" = "먺먻먼먽먾먿멀멁멂멃멄멅멆멇멈멉멊멋멌멍멎멏멐멑",
		"Line  9" = "멒멓메멕멖멗멘멙멚멛멜멝멞멟멠멡멢멣멤멥멦멧멨멩",
		"Line 10" = "멪멫멬멭멮멯며멱멲멳면멵멶멷멸멹멺멻멼멽멾멿몀몁",
		"Line 11" = "몂몃몄명몆몇몈몉몊몋몌몍몎몏몐몑몒몓몔몕몖몗몘몙",
		"Line 12" = "몚몛몜몝몞몟몠몡몢몣몤몥몦몧모목몪몫몬몭몮몯몰몱",
		"Line 13" = "몲몳몴몵몶몷몸몹몺못몼몽몾몿뫀뫁뫂뫃뫄뫅뫆뫇뫈뫉",
		"Line 14" = "뫊뫋뫌뫍뫎뫏뫐뫑뫒뫓뫔뫕뫖뫗뫘뫙뫚뫛뫜뫝뫞뫟뫠뫡",
		"Line 15" = "뫢뫣뫤뫥뫦뫧뫨뫩뫪뫫뫬뫭뫮뫯뫰뫱뫲뫳뫴뫵뫶뫷뫸뫹",
		"Line 16" = "뫺뫻뫼뫽뫾뫿묀묁묂묃묄묅묆묇묈묉묊묋묌묍묎묏묐묑",
		"Line 17" = "묒묓묔묕묖묗묘묙묚묛묜묝묞묟묠묡묢묣묤묥묦묧묨묩",
		"Line 18" = "묪묫묬묭묮묯묰묱묲묳무묵묶묷문묹묺묻물묽묾묿뭀뭁",
		"Line 19" = "뭂뭃뭄뭅뭆뭇뭈뭉뭊뭋뭌뭍뭎뭏뭐뭑뭒뭓뭔뭕뭖뭗뭘뭙",
		"Line 20" = "뭚뭛뭜뭝뭞뭟뭠뭡뭢뭣뭤뭥뭦뭧뭨뭩뭪뭫뭬뭭뭮뭯뭰뭱",
		"Line 21" = "뭲뭳뭴뭵뭶뭷뭸뭹뭺뭻뭼뭽뭾뭿뮀뮁뮂뮃뮄뮅뮆뮇뮈뮉",
		"Line 22" = "뮊뮋뮌뮍뮎뮏뮐뮑뮒뮓뮔뮕뮖뮗뮘뮙뮚뮛뮜뮝뮞뮟뮠뮡",
		"Line 23" = "뮢뮣뮤뮥뮦뮧뮨뮩뮪뮫뮬뮭뮮뮯뮰뮱뮲뮳뮴뮵뮶뮷뮸뮹",
	},
	"Jamo08": {
		"Line  0" = "뮹뮺뮻뮼뮽뮾뮿므믁믂믃믄믅믆믇믈믉믊믋믌믍믎믏믐",
		"Line  1" = "믑믒믓믔믕믖믗믘믙믚믛믜믝믞믟믠믡믢믣믤믥믦믧믨",
		"Line  2" = "믩믪믫믬믭믮믯믰믱믲믳믴믵믶믷미믹믺믻민믽믾믿밀",
		"Line  3" = "밁밂밃밄밅밆밇밈밉밊밋밌밍밎및밐밑밒밓바박밖밗반",
		"Line  4" = "밙밚받발밝밞밟밠밡밢밣밤밥밦밧밨방밪밫밬밭밮밯배",
		"Line  5" = "백밲밳밴밵밶밷밸밹밺밻밼밽밾밿뱀뱁뱂뱃뱄뱅뱆뱇뱈",
		"Line  6" = "뱉뱊뱋뱌뱍뱎뱏뱐뱑뱒뱓뱔뱕뱖뱗뱘뱙뱚뱛뱜뱝뱞뱟뱠",
		"Line  7" = "뱡뱢뱣뱤뱥뱦뱧뱨뱩뱪뱫뱬뱭뱮뱯뱰뱱뱲뱳뱴뱵뱶뱷뱸",
		"Line  8" = "뱹뱺뱻뱼뱽뱾뱿벀벁벂벃버벅벆벇번벉벊벋벌벍벎벏벐",
		"Line  9" = "벑벒벓범법벖벗벘벙벚벛벜벝벞벟베벡벢벣벤벥벦벧벨",
		"Line 10" = "벩벪벫벬벭벮벯벰벱벲벳벴벵벶벷벸벹벺벻벼벽벾벿변",
		"Line 11" = "볁볂볃별볅볆볇볈볉볊볋볌볍볎볏볐병볒볓볔볕볖볗볘",
		"Line 12" = "볙볚볛볜볝볞볟볠볡볢볣볤볥볦볧볨볩볪볫볬볭볮볯볰",
		"Line 13" = "볱볲볳보복볶볷본볹볺볻볼볽볾볿봀봁봂봃봄봅봆봇봈",
		"Line 14" = "봉봊봋봌봍봎봏봐봑봒봓봔봕봖봗봘봙봚봛봜봝봞봟봠",
		"Line 15" = "봡봢봣봤봥봦봧봨봩봪봫봬봭봮봯봰봱봲봳봴봵봶봷봸",
		"Line 16" = "봹봺봻봼봽봾봿뵀뵁뵂뵃뵄뵅뵆뵇뵈뵉뵊뵋뵌뵍뵎뵏뵐",
		"Line 17" = "뵑뵒뵓뵔뵕뵖뵗뵘뵙뵚뵛뵜뵝뵞뵟뵠뵡뵢뵣뵤뵥뵦뵧뵨",
		"Line 18" = "뵩뵪뵫뵬뵭뵮뵯뵰뵱뵲뵳뵴뵵뵶뵷뵸뵹뵺뵻뵼뵽뵾뵿부",
		"Line 19" = "북붂붃분붅붆붇불붉붊붋붌붍붎붏붐붑붒붓붔붕붖붗붘",
		"Line 20" = "붙붚붛붜붝붞붟붠붡붢붣붤붥붦붧붨붩붪붫붬붭붮붯붰",
		"Line 21" = "붱붲붳붴붵붶붷붸붹붺붻붼붽붾붿뷀뷁뷂뷃뷄뷅뷆뷇뷈",
		"Line 22" = "뷉뷊뷋뷌뷍뷎뷏뷐뷑뷒뷓뷔뷕뷖뷗뷘뷙뷚뷛뷜뷝뷞뷟뷠",
		"Line 23" = "뷡뷢뷣뷤뷥뷦뷧뷨뷩뷪뷫뷬뷭뷮뷯뷰뷱뷲뷳뷴뷵뷶뷷뷸",
	},
	"Jamo09": {
		"Line  0" = "뷸뷹뷺뷻뷼뷽뷾뷿븀븁븂븃븄븅븆븇븈븉븊븋브븍븎븏",
		"Line  1" = "븐븑븒븓블븕븖븗븘븙븚븛븜븝븞븟븠븡븢븣븤븥븦븧",
		"Line  2" = "븨븩븪븫븬븭븮븯븰븱븲븳븴븵븶븷븸븹븺븻븼븽븾븿",
		"Line  3" = "빀빁빂빃비빅빆빇빈빉빊빋빌빍빎빏빐빑빒빓빔빕빖빗",
		"Line  4" = "빘빙빚빛빜빝빞빟빠빡빢빣빤빥빦빧빨빩빪빫빬빭빮빯",
		"Line  5" = "빰빱빲빳빴빵빶빷빸빹빺빻빼빽빾빿뺀뺁뺂뺃뺄뺅뺆뺇",
		"Line  6" = "뺈뺉뺊뺋뺌뺍뺎뺏뺐뺑뺒뺓뺔뺕뺖뺗뺘뺙뺚뺛뺜뺝뺞뺟",
		"Line  7" = "뺠뺡뺢뺣뺤뺥뺦뺧뺨뺩뺪뺫뺬뺭뺮뺯뺰뺱뺲뺳뺴뺵뺶뺷",
		"Line  8" = "뺸뺹뺺뺻뺼뺽뺾뺿뻀뻁뻂뻃뻄뻅뻆뻇뻈뻉뻊뻋뻌뻍뻎뻏",
		"Line  9" = "뻐뻑뻒뻓뻔뻕뻖뻗뻘뻙뻚뻛뻜뻝뻞뻟뻠뻡뻢뻣뻤뻥뻦뻧",
		"Line 10" = "뻨뻩뻪뻫뻬뻭뻮뻯뻰뻱뻲뻳뻴뻵뻶뻷뻸뻹뻺뻻뻼뻽뻾뻿",
		"Line 11" = "뼀뼁뼂뼃뼄뼅뼆뼇뼈뼉뼊뼋뼌뼍뼎뼏뼐뼑뼒뼓뼔뼕뼖뼗",
		"Line 12" = "뼘뼙뼚뼛뼜뼝뼞뼟뼠뼡뼢뼣뼤뼥뼦뼧뼨뼩뼪뼫뼬뼭뼮뼯",
		"Line 13" = "뼰뼱뼲뼳뼴뼵뼶뼷뼸뼹뼺뼻뼼뼽뼾뼿뽀뽁뽂뽃뽄뽅뽆뽇",
		"Line 14" = "뽈뽉뽊뽋뽌뽍뽎뽏뽐뽑뽒뽓뽔뽕뽖뽗뽘뽙뽚뽛뽜뽝뽞뽟",
		"Line 15" = "뽠뽡뽢뽣뽤뽥뽦뽧뽨뽩뽪뽫뽬뽭뽮뽯뽰뽱뽲뽳뽴뽵뽶뽷",
		"Line 16" = "뽸뽹뽺뽻뽼뽽뽾뽿뾀뾁뾂뾃뾄뾅뾆뾇뾈뾉뾊뾋뾌뾍뾎뾏",
		"Line 17" = "뾐뾑뾒뾓뾔뾕뾖뾗뾘뾙뾚뾛뾜뾝뾞뾟뾠뾡뾢뾣뾤뾥뾦뾧",
		"Line 18" = "뾨뾩뾪뾫뾬뾭뾮뾯뾰뾱뾲뾳뾴뾵뾶뾷뾸뾹뾺뾻뾼뾽뾾뾿",
		"Line 19" = "뿀뿁뿂뿃뿄뿅뿆뿇뿈뿉뿊뿋뿌뿍뿎뿏뿐뿑뿒뿓뿔뿕뿖뿗",
		"Line 20" = "뿘뿙뿚뿛뿜뿝뿞뿟뿠뿡뿢뿣뿤뿥뿦뿧뿨뿩뿪뿫뿬뿭뿮뿯",
		"Line 21" = "뿰뿱뿲뿳뿴뿵뿶뿷뿸뿹뿺뿻뿼뿽뿾뿿쀀쀁쀂쀃쀄쀅쀆쀇",
		"Line 22" = "쀈쀉쀊쀋쀌쀍쀎쀏쀐쀑쀒쀓쀔쀕쀖쀗쀘쀙쀚쀛쀜쀝쀞쀟",
		"Line 23" = "쀠쀡쀢쀣쀤쀥쀦쀧쀨쀩쀪쀫쀬쀭쀮쀯쀰쀱쀲쀳쀴쀵쀶쀷",
	},
	"Jamo10": {
		"Line  0" = "쀷쀸쀹쀺쀻쀼쀽쀾쀿쁀쁁쁂쁃쁄쁅쁆쁇쁈쁉쁊쁋쁌쁍쁎",
		"Line  1" = "쁏쁐쁑쁒쁓쁔쁕쁖쁗쁘쁙쁚쁛쁜쁝쁞쁟쁠쁡쁢쁣쁤쁥쁦",
		"Line  2" = "쁧쁨쁩쁪쁫쁬쁭쁮쁯쁰쁱쁲쁳쁴쁵쁶쁷쁸쁹쁺쁻쁼쁽쁾",
		"Line  3" = "쁿삀삁삂삃삄삅삆삇삈삉삊삋삌삍삎삏삐삑삒삓삔삕삖",
		"Line  4" = "삗삘삙삚삛삜삝삞삟삠삡삢삣삤삥삦삧삨삩삪삫사삭삮",
		"Line  5" = "삯산삱삲삳살삵삶삷삸삹삺삻삼삽삾삿샀상샂샃샄샅샆",
		"Line  6" = "샇새색샊샋샌샍샎샏샐샑샒샓샔샕샖샗샘샙샚샛샜생샞",
		"Line  7" = "샟샠샡샢샣샤샥샦샧샨샩샪샫샬샭샮샯샰샱샲샳샴샵샶",
		"Line  8" = "샷샸샹샺샻샼샽샾샿섀섁섂섃섄섅섆섇섈섉섊섋섌섍섎",
		"Line  9" = "섏섐섑섒섓섔섕섖섗섘섙섚섛서석섞섟선섡섢섣설섥섦",
		"Line 10" = "섧섨섩섪섫섬섭섮섯섰성섲섳섴섵섶섷세섹섺섻센섽섾",
		"Line 11" = "섿셀셁셂셃셄셅셆셇셈셉셊셋셌셍셎셏셐셑셒셓셔셕셖",
		"Line 12" = "셗션셙셚셛셜셝셞셟셠셡셢셣셤셥셦셧셨셩셪셫셬셭셮",
		"Line 13" = "셯셰셱셲셳셴셵셶셷셸셹셺셻셼셽셾셿솀솁솂솃솄솅솆",
		"Line 14" = "솇솈솉솊솋소속솎솏손솑솒솓솔솕솖솗솘솙솚솛솜솝솞",
		"Line 15" = "솟솠송솢솣솤솥솦솧솨솩솪솫솬솭솮솯솰솱솲솳솴솵솶",
		"Line 16" = "솷솸솹솺솻솼솽솾솿쇀쇁쇂쇃쇄쇅쇆쇇쇈쇉쇊쇋쇌쇍쇎",
		"Line 17" = "쇏쇐쇑쇒쇓쇔쇕쇖쇗쇘쇙쇚쇛쇜쇝쇞쇟쇠쇡쇢쇣쇤쇥쇦",
		"Line 18" = "쇧쇨쇩쇪쇫쇬쇭쇮쇯쇰쇱쇲쇳쇴쇵쇶쇷쇸쇹쇺쇻쇼쇽쇾",
		"Line 19" = "쇿숀숁숂숃숄숅숆숇숈숉숊숋숌숍숎숏숐숑숒숓숔숕숖",
		"Line 20" = "숗수숙숚숛순숝숞숟술숡숢숣숤숥숦숧숨숩숪숫숬숭숮",
		"Line 21" = "숯숰숱숲숳숴숵숶숷숸숹숺숻숼숽숾숿쉀쉁쉂쉃쉄쉅쉆",
		"Line 22" = "쉇쉈쉉쉊쉋쉌쉍쉎쉏쉐쉑쉒쉓쉔쉕쉖쉗쉘쉙쉚쉛쉜쉝쉞",
		"Line 23" = "쉟쉠쉡쉢쉣쉤쉥쉦쉧쉨쉩쉪쉫쉬쉭쉮쉯쉰쉱쉲쉳쉴쉵쉶",
	},
	"Jamo11": {
		"Line  0" = "쉶쉷쉸쉹쉺쉻쉼쉽쉾쉿슀슁슂슃슄슅슆슇슈슉슊슋슌슍",
		"Line  1" = "슎슏슐슑슒슓슔슕슖슗슘슙슚슛슜슝슞슟슠슡슢슣스슥",
		"Line  2" = "슦슧슨슩슪슫슬슭슮슯슰슱슲슳슴습슶슷슸승슺슻슼슽",
		"Line  3" = "슾슿싀싁싂싃싄싅싆싇싈싉싊싋싌싍싎싏싐싑싒싓싔싕",
		"Line  4" = "싖싗싘싙싚싛시식싞싟신싡싢싣실싥싦싧싨싩싪싫심십",
		"Line  5" = "싮싯싰싱싲싳싴싵싶싷싸싹싺싻싼싽싾싿쌀쌁쌂쌃쌄쌅",
		"Line  6" = "쌆쌇쌈쌉쌊쌋쌌쌍쌎쌏쌐쌑쌒쌓쌔쌕쌖쌗쌘쌙쌚쌛쌜쌝",
		"Line  7" = "쌞쌟쌠쌡쌢쌣쌤쌥쌦쌧쌨쌩쌪쌫쌬쌭쌮쌯쌰쌱쌲쌳쌴쌵",
		"Line  8" = "쌶쌷쌸쌹쌺쌻쌼쌽쌾쌿썀썁썂썃썄썅썆썇썈썉썊썋썌썍",
		"Line  9" = "썎썏썐썑썒썓썔썕썖썗썘썙썚썛썜썝썞썟썠썡썢썣썤썥",
		"Line 10" = "썦썧써썩썪썫썬썭썮썯썰썱썲썳썴썵썶썷썸썹썺썻썼썽",
		"Line 11" = "썾썿쎀쎁쎂쎃쎄쎅쎆쎇쎈쎉쎊쎋쎌쎍쎎쎏쎐쎑쎒쎓쎔쎕",
		"Line 12" = "쎖쎗쎘쎙쎚쎛쎜쎝쎞쎟쎠쎡쎢쎣쎤쎥쎦쎧쎨쎩쎪쎫쎬쎭",
		"Line 13" = "쎮쎯쎰쎱쎲쎳쎴쎵쎶쎷쎸쎹쎺쎻쎼쎽쎾쎿쏀쏁쏂쏃쏄쏅",
		"Line 14" = "쏆쏇쏈쏉쏊쏋쏌쏍쏎쏏쏐쏑쏒쏓쏔쏕쏖쏗쏘쏙쏚쏛쏜쏝",
		"Line 15" = "쏞쏟쏠쏡쏢쏣쏤쏥쏦쏧쏨쏩쏪쏫쏬쏭쏮쏯쏰쏱쏲쏳쏴쏵",
		"Line 16" = "쏶쏷쏸쏹쏺쏻쏼쏽쏾쏿쐀쐁쐂쐃쐄쐅쐆쐇쐈쐉쐊쐋쐌쐍",
		"Line 17" = "쐎쐏쐐쐑쐒쐓쐔쐕쐖쐗쐘쐙쐚쐛쐜쐝쐞쐟쐠쐡쐢쐣쐤쐥",
		"Line 18" = "쐦쐧쐨쐩쐪쐫쐬쐭쐮쐯쐰쐱쐲쐳쐴쐵쐶쐷쐸쐹쐺쐻쐼쐽",
		"Line 19" = "쐾쐿쑀쑁쑂쑃쑄쑅쑆쑇쑈쑉쑊쑋쑌쑍쑎쑏쑐쑑쑒쑓쑔쑕",
		"Line 20" = "쑖쑗쑘쑙쑚쑛쑜쑝쑞쑟쑠쑡쑢쑣쑤쑥쑦쑧쑨쑩쑪쑫쑬쑭",
		"Line 21" = "쑮쑯쑰쑱쑲쑳쑴쑵쑶쑷쑸쑹쑺쑻쑼쑽쑾쑿쒀쒁쒂쒃쒄쒅",
		"Line 22" = "쒆쒇쒈쒉쒊쒋쒌쒍쒎쒏쒐쒑쒒쒓쒔쒕쒖쒗쒘쒙쒚쒛쒜쒝",
		"Line 23" = "쒞쒟쒠쒡쒢쒣쒤쒥쒦쒧쒨쒩쒪쒫쒬쒭쒮쒯쒰쒱쒲쒳쒴쒵",
	},
	"Jamo12": {
		"Line  0" = "쒵쒶쒷쒸쒹쒺쒻쒼쒽쒾쒿쓀쓁쓂쓃쓄쓅쓆쓇쓈쓉쓊쓋쓌",
		"Line  1" = "쓍쓎쓏쓐쓑쓒쓓쓔쓕쓖쓗쓘쓙쓚쓛쓜쓝쓞쓟쓠쓡쓢쓣쓤",
		"Line  2" = "쓥쓦쓧쓨쓩쓪쓫쓬쓭쓮쓯쓰쓱쓲쓳쓴쓵쓶쓷쓸쓹쓺쓻쓼",
		"Line  3" = "쓽쓾쓿씀씁씂씃씄씅씆씇씈씉씊씋씌씍씎씏씐씑씒씓씔",
		"Line  4" = "씕씖씗씘씙씚씛씜씝씞씟씠씡씢씣씤씥씦씧씨씩씪씫씬",
		"Line  5" = "씭씮씯씰씱씲씳씴씵씶씷씸씹씺씻씼씽씾씿앀앁앂앃아",
		"Line  6" = "악앆앇안앉않앋알앍앎앏앐앑앒앓암압앖앗았앙앚앛앜",
		"Line  7" = "앝앞앟애액앢앣앤앥앦앧앨앩앪앫앬앭앮앯앰앱앲앳앴",
		"Line  8" = "앵앶앷앸앹앺앻야약앾앿얀얁얂얃얄얅얆얇얈얉얊얋얌",
		"Line  9" = "얍얎얏얐양얒얓얔얕얖얗얘얙얚얛얜얝얞얟얠얡얢얣얤",
		"Line 10" = "얥얦얧얨얩얪얫얬얭얮얯얰얱얲얳어억얶얷언얹얺얻얼",
		"Line 11" = "얽얾얿엀엁엂엃엄업없엇었엉엊엋엌엍엎엏에엑엒엓엔",
		"Line 12" = "엕엖엗엘엙엚엛엜엝엞엟엠엡엢엣엤엥엦엧엨엩엪엫여",
		"Line 13" = "역엮엯연엱엲엳열엵엶엷엸엹엺엻염엽엾엿였영옂옃옄",
		"Line 14" = "옅옆옇예옉옊옋옌옍옎옏옐옑옒옓옔옕옖옗옘옙옚옛옜",
		"Line 15" = "옝옞옟옠옡옢옣오옥옦옧온옩옪옫올옭옮옯옰옱옲옳옴",
		"Line 16" = "옵옶옷옸옹옺옻옼옽옾옿와왁왂왃완왅왆왇왈왉왊왋왌",
		"Line 17" = "왍왎왏왐왑왒왓왔왕왖왗왘왙왚왛왜왝왞왟왠왡왢왣왤",
		"Line 18" = "왥왦왧왨왩왪왫왬왭왮왯왰왱왲왳왴왵왶왷외왹왺왻왼",
		"Line 19" = "왽왾왿욀욁욂욃욄욅욆욇욈욉욊욋욌욍욎욏욐욑욒욓요",
		"Line 20" = "욕욖욗욘욙욚욛욜욝욞욟욠욡욢욣욤욥욦욧욨용욪욫욬",
		"Line 21" = "욭욮욯우욱욲욳운욵욶욷울욹욺욻욼욽욾욿움웁웂웃웄",
		"Line 22" = "웅웆웇웈웉웊웋워웍웎웏원웑웒웓월웕웖웗웘웙웚웛웜",
		"Line 23" = "웝웞웟웠웡웢웣웤웥웦웧웨웩웪웫웬웭웮웯웰웱웲웳웴",
	},
	"Jamo13": {
		"Line  0" = "웴웵웶웷웸웹웺웻웼웽웾웿윀윁윂윃위윅윆윇윈윉윊윋",
		"Line  1" = "윌윍윎윏윐윑윒윓윔윕윖윗윘윙윚윛윜윝윞윟유육윢윣",
		"Line  2" = "윤윥윦윧율윩윪윫윬윭윮윯윰윱윲윳윴융윶윷윸윹윺윻",
		"Line  3" = "으윽윾윿은읁읂읃을읅읆읇읈읉읊읋음읍읎읏읐응읒읓",
		"Line  4" = "읔읕읖읗의읙읚읛읜읝읞읟읠읡읢읣읤읥읦읧읨읩읪읫",
		"Line  5" = "읬읭읮읯읰읱읲읳이익읶읷인읹읺읻일읽읾읿잀잁잂잃",
		"Line  6" = "임입잆잇있잉잊잋잌잍잎잏자작잒잓잔잕잖잗잘잙잚잛",
		"Line  7" = "잜잝잞잟잠잡잢잣잤장잦잧잨잩잪잫재잭잮잯잰잱잲잳",
		"Line  8" = "잴잵잶잷잸잹잺잻잼잽잾잿쟀쟁쟂쟃쟄쟅쟆쟇쟈쟉쟊쟋",
		"Line  9" = "쟌쟍쟎쟏쟐쟑쟒쟓쟔쟕쟖쟗쟘쟙쟚쟛쟜쟝쟞쟟쟠쟡쟢쟣",
		"Line 10" = "쟤쟥쟦쟧쟨쟩쟪쟫쟬쟭쟮쟯쟰쟱쟲쟳쟴쟵쟶쟷쟸쟹쟺쟻",
		"Line 11" = "쟼쟽쟾쟿저적젂젃전젅젆젇절젉젊젋젌젍젎젏점접젒젓",
		"Line 12" = "젔정젖젗젘젙젚젛제젝젞젟젠젡젢젣젤젥젦젧젨젩젪젫",
		"Line 13" = "젬젭젮젯젰젱젲젳젴젵젶젷져젹젺젻젼젽젾젿졀졁졂졃",
		"Line 14" = "졄졅졆졇졈졉졊졋졌졍졎졏졐졑졒졓졔졕졖졗졘졙졚졛",
		"Line 15" = "졜졝졞졟졠졡졢졣졤졥졦졧졨졩졪졫졬졭졮졯조족졲졳",
		"Line 16" = "존졵졶졷졸졹졺졻졼졽졾졿좀좁좂좃좄종좆좇좈좉좊좋",
		"Line 17" = "좌좍좎좏좐좑좒좓좔좕좖좗좘좙좚좛좜좝좞좟좠좡좢좣",
		"Line 18" = "좤좥좦좧좨좩좪좫좬좭좮좯좰좱좲좳좴좵좶좷좸좹좺좻",
		"Line 19" = "좼좽좾좿죀죁죂죃죄죅죆죇죈죉죊죋죌죍죎죏죐죑죒죓",
		"Line 20" = "죔죕죖죗죘죙죚죛죜죝죞죟죠죡죢죣죤죥죦죧죨죩죪죫",
		"Line 21" = "죬죭죮죯죰죱죲죳죴죵죶죷죸죹죺죻주죽죾죿준줁줂줃",
		"Line 22" = "줄줅줆줇줈줉줊줋줌줍줎줏줐중줒줓줔줕줖줗줘줙줚줛",
		"Line 23" = "줜줝줞줟줠줡줢줣줤줥줦줧줨줩줪줫줬줭줮줯줰줱줲줳",
	},
	"Jamo14": {
		"Line  0" = "줳줴줵줶줷줸줹줺줻줼줽줾줿쥀쥁쥂쥃쥄쥅쥆쥇쥈쥉쥊",
		"Line  1" = "쥋쥌쥍쥎쥏쥐쥑쥒쥓쥔쥕쥖쥗쥘쥙쥚쥛쥜쥝쥞쥟쥠쥡쥢",
		"Line  2" = "쥣쥤쥥쥦쥧쥨쥩쥪쥫쥬쥭쥮쥯쥰쥱쥲쥳쥴쥵쥶쥷쥸쥹쥺",
		"Line  3" = "쥻쥼쥽쥾쥿즀즁즂즃즄즅즆즇즈즉즊즋즌즍즎즏즐즑즒",
		"Line  4" = "즓즔즕즖즗즘즙즚즛즜증즞즟즠즡즢즣즤즥즦즧즨즩즪",
		"Line  5" = "즫즬즭즮즯즰즱즲즳즴즵즶즷즸즹즺즻즼즽즾즿지직짂",
		"Line  6" = "짃진짅짆짇질짉짊짋짌짍짎짏짐집짒짓짔징짖짗짘짙짚",
		"Line  7" = "짛짜짝짞짟짠짡짢짣짤짥짦짧짨짩짪짫짬짭짮짯짰짱짲",
		"Line  8" = "짳짴짵짶짷째짹짺짻짼짽짾짿쨀쨁쨂쨃쨄쨅쨆쨇쨈쨉쨊",
		"Line  9" = "쨋쨌쨍쨎쨏쨐쨑쨒쨓쨔쨕쨖쨗쨘쨙쨚쨛쨜쨝쨞쨟쨠쨡쨢",
		"Line 10" = "쨣쨤쨥쨦쨧쨨쨩쨪쨫쨬쨭쨮쨯쨰쨱쨲쨳쨴쨵쨶쨷쨸쨹쨺",
		"Line 11" = "쨻쨼쨽쨾쨿쩀쩁쩂쩃쩄쩅쩆쩇쩈쩉쩊쩋쩌쩍쩎쩏쩐쩑쩒",
		"Line 12" = "쩓쩔쩕쩖쩗쩘쩙쩚쩛쩜쩝쩞쩟쩠쩡쩢쩣쩤쩥쩦쩧쩨쩩쩪",
		"Line 13" = "쩫쩬쩭쩮쩯쩰쩱쩲쩳쩴쩵쩶쩷쩸쩹쩺쩻쩼쩽쩾쩿쪀쪁쪂",
		"Line 14" = "쪃쪄쪅쪆쪇쪈쪉쪊쪋쪌쪍쪎쪏쪐쪑쪒쪓쪔쪕쪖쪗쪘쪙쪚",
		"Line 15" = "쪛쪜쪝쪞쪟쪠쪡쪢쪣쪤쪥쪦쪧쪨쪩쪪쪫쪬쪭쪮쪯쪰쪱쪲",
		"Line 16" = "쪳쪴쪵쪶쪷쪸쪹쪺쪻쪼쪽쪾쪿쫀쫁쫂쫃쫄쫅쫆쫇쫈쫉쫊",
		"Line 17" = "쫋쫌쫍쫎쫏쫐쫑쫒쫓쫔쫕쫖쫗쫘쫙쫚쫛쫜쫝쫞쫟쫠쫡쫢",
		"Line 18" = "쫣쫤쫥쫦쫧쫨쫩쫪쫫쫬쫭쫮쫯쫰쫱쫲쫳쫴쫵쫶쫷쫸쫹쫺",
		"Line 19" = "쫻쫼쫽쫾쫿쬀쬁쬂쬃쬄쬅쬆쬇쬈쬉쬊쬋쬌쬍쬎쬏쬐쬑쬒",
		"Line 20" = "쬓쬔쬕쬖쬗쬘쬙쬚쬛쬜쬝쬞쬟쬠쬡쬢쬣쬤쬥쬦쬧쬨쬩쬪",
		"Line 21" = "쬫쬬쬭쬮쬯쬰쬱쬲쬳쬴쬵쬶쬷쬸쬹쬺쬻쬼쬽쬾쬿쭀쭁쭂",
		"Line 22" = "쭃쭄쭅쭆쭇쭈쭉쭊쭋쭌쭍쭎쭏쭐쭑쭒쭓쭔쭕쭖쭗쭘쭙쭚",
		"Line 23" = "쭛쭜쭝쭞쭟쭠쭡쭢쭣쭤쭥쭦쭧쭨쭩쭪쭫쭬쭭쭮쭯쭰쭱쭲",
	},
	"Jamo15": {
		"Line  0" = "쭲쭳쭴쭵쭶쭷쭸쭹쭺쭻쭼쭽쭾쭿쮀쮁쮂쮃쮄쮅쮆쮇쮈쮉",
		"Line  1" = "쮊쮋쮌쮍쮎쮏쮐쮑쮒쮓쮔쮕쮖쮗쮘쮙쮚쮛쮜쮝쮞쮟쮠쮡",
		"Line  2" = "쮢쮣쮤쮥쮦쮧쮨쮩쮪쮫쮬쮭쮮쮯쮰쮱쮲쮳쮴쮵쮶쮷쮸쮹",
		"Line  3" = "쮺쮻쮼쮽쮾쮿쯀쯁쯂쯃쯄쯅쯆쯇쯈쯉쯊쯋쯌쯍쯎쯏쯐쯑",
		"Line  4" = "쯒쯓쯔쯕쯖쯗쯘쯙쯚쯛쯜쯝쯞쯟쯠쯡쯢쯣쯤쯥쯦쯧쯨쯩",
		"Line  5" = "쯪쯫쯬쯭쯮쯯쯰쯱쯲쯳쯴쯵쯶쯷쯸쯹쯺쯻쯼쯽쯾쯿찀찁",
		"Line  6" = "찂찃찄찅찆찇찈찉찊찋찌찍찎찏찐찑찒찓찔찕찖찗찘찙",
		"Line  7" = "찚찛찜찝찞찟찠찡찢찣찤찥찦찧차착찪찫찬찭찮찯찰찱",
		"Line  8" = "찲찳찴찵찶찷참찹찺찻찼창찾찿챀챁챂챃채책챆챇챈챉",
		"Line  9" = "챊챋챌챍챎챏챐챑챒챓챔챕챖챗챘챙챚챛챜챝챞챟챠챡",
		"Line 10" = "챢챣챤챥챦챧챨챩챪챫챬챭챮챯챰챱챲챳챴챵챶챷챸챹",
		"Line 11" = "챺챻챼챽챾챿첀첁첂첃첄첅첆첇첈첉첊첋첌첍첎첏첐첑",
		"Line 12" = "첒첓첔첕첖첗처척첚첛천첝첞첟철첡첢첣첤첥첦첧첨첩",
		"Line 13" = "첪첫첬청첮첯첰첱첲첳체첵첶첷첸첹첺첻첼첽첾첿쳀쳁",
		"Line 14" = "쳂쳃쳄쳅쳆쳇쳈쳉쳊쳋쳌쳍쳎쳏쳐쳑쳒쳓쳔쳕쳖쳗쳘쳙",
		"Line 15" = "쳚쳛쳜쳝쳞쳟쳠쳡쳢쳣쳤쳥쳦쳧쳨쳩쳪쳫쳬쳭쳮쳯쳰쳱",
		"Line 16" = "쳲쳳쳴쳵쳶쳷쳸쳹쳺쳻쳼쳽쳾쳿촀촁촂촃촄촅촆촇초촉",
		"Line 17" = "촊촋촌촍촎촏촐촑촒촓촔촕촖촗촘촙촚촛촜총촞촟촠촡",
		"Line 18" = "촢촣촤촥촦촧촨촩촪촫촬촭촮촯촰촱촲촳촴촵촶촷촸촹",
		"Line 19" = "촺촻촼촽촾촿쵀쵁쵂쵃쵄쵅쵆쵇쵈쵉쵊쵋쵌쵍쵎쵏쵐쵑",
		"Line 20" = "쵒쵓쵔쵕쵖쵗쵘쵙쵚쵛최쵝쵞쵟쵠쵡쵢쵣쵤쵥쵦쵧쵨쵩",
		"Line 21" = "쵪쵫쵬쵭쵮쵯쵰쵱쵲쵳쵴쵵쵶쵷쵸쵹쵺쵻쵼쵽쵾쵿춀춁",
		"Line 22" = "춂춃춄춅춆춇춈춉춊춋춌춍춎춏춐춑춒춓추축춖춗춘춙",
		"Line 23" = "춚춛출춝춞춟춠춡춢춣춤춥춦춧춨충춪춫춬춭춮춯춰춱",
	},
	"Jamo16": {
		"Line  0" = "춱춲춳춴춵춶춷춸춹춺춻춼춽춾춿췀췁췂췃췄췅췆췇췈",
		"Line  1" = "췉췊췋췌췍췎췏췐췑췒췓췔췕췖췗췘췙췚췛췜췝췞췟췠",
		"Line  2" = "췡췢췣췤췥췦췧취췩췪췫췬췭췮췯췰췱췲췳췴췵췶췷췸",
		"Line  3" = "췹췺췻췼췽췾췿츀츁츂츃츄츅츆츇츈츉츊츋츌츍츎츏츐",
		"Line  4" = "츑츒츓츔츕츖츗츘츙츚츛츜츝츞츟츠측츢츣츤츥츦츧츨",
		"Line  5" = "츩츪츫츬츭츮츯츰츱츲츳츴층츶츷츸츹츺츻츼츽츾츿칀",
		"Line  6" = "칁칂칃칄칅칆칇칈칉칊칋칌칍칎칏칐칑칒칓칔칕칖칗치",
		"Line  7" = "칙칚칛친칝칞칟칠칡칢칣칤칥칦칧침칩칪칫칬칭칮칯칰",
		"Line  8" = "칱칲칳카칵칶칷칸칹칺칻칼칽칾칿캀캁캂캃캄캅캆캇캈",
		"Line  9" = "캉캊캋캌캍캎캏캐캑캒캓캔캕캖캗캘캙캚캛캜캝캞캟캠",
		"Line 10" = "캡캢캣캤캥캦캧캨캩캪캫캬캭캮캯캰캱캲캳캴캵캶캷캸",
		"Line 11" = "캹캺캻캼캽캾캿컀컁컂컃컄컅컆컇컈컉컊컋컌컍컎컏컐",
		"Line 12" = "컑컒컓컔컕컖컗컘컙컚컛컜컝컞컟컠컡컢컣커컥컦컧컨",
		"Line 13" = "컩컪컫컬컭컮컯컰컱컲컳컴컵컶컷컸컹컺컻컼컽컾컿케",
		"Line 14" = "켁켂켃켄켅켆켇켈켉켊켋켌켍켎켏켐켑켒켓켔켕켖켗켘",
		"Line 15" = "켙켚켛켜켝켞켟켠켡켢켣켤켥켦켧켨켩켪켫켬켭켮켯켰",
		"Line 16" = "켱켲켳켴켵켶켷켸켹켺켻켼켽켾켿콀콁콂콃콄콅콆콇콈",
		"Line 17" = "콉콊콋콌콍콎콏콐콑콒콓코콕콖콗콘콙콚콛콜콝콞콟콠",
		"Line 18" = "콡콢콣콤콥콦콧콨콩콪콫콬콭콮콯콰콱콲콳콴콵콶콷콸",
		"Line 19" = "콹콺콻콼콽콾콿쾀쾁쾂쾃쾄쾅쾆쾇쾈쾉쾊쾋쾌쾍쾎쾏쾐",
		"Line 20" = "쾑쾒쾓쾔쾕쾖쾗쾘쾙쾚쾛쾜쾝쾞쾟쾠쾡쾢쾣쾤쾥쾦쾧쾨",
		"Line 21" = "쾩쾪쾫쾬쾭쾮쾯쾰쾱쾲쾳쾴쾵쾶쾷쾸쾹쾺쾻쾼쾽쾾쾿쿀",
		"Line 22" = "쿁쿂쿃쿄쿅쿆쿇쿈쿉쿊쿋쿌쿍쿎쿏쿐쿑쿒쿓쿔쿕쿖쿗쿘",
		"Line 23" = "쿙쿚쿛쿜쿝쿞쿟쿠쿡쿢쿣쿤쿥쿦쿧쿨쿩쿪쿫쿬쿭쿮쿯쿰",
	},
	"Jamo17": {
		"Line  0" = "쿰쿱쿲쿳쿴쿵쿶쿷쿸쿹쿺쿻쿼쿽쿾쿿퀀퀁퀂퀃퀄퀅퀆퀇",
		"Line  1" = "퀈퀉퀊퀋퀌퀍퀎퀏퀐퀑퀒퀓퀔퀕퀖퀗퀘퀙퀚퀛퀜퀝퀞퀟",
		"Line  2" = "퀠퀡퀢퀣퀤퀥퀦퀧퀨퀩퀪퀫퀬퀭퀮퀯퀰퀱퀲퀳퀴퀵퀶퀷",
		"Line  3" = "퀸퀹퀺퀻퀼퀽퀾퀿큀큁큂큃큄큅큆큇큈큉큊큋큌큍큎큏",
		"Line  4" = "큐큑큒큓큔큕큖큗큘큙큚큛큜큝큞큟큠큡큢큣큤큥큦큧",
		"Line  5" = "큨큩큪큫크큭큮큯큰큱큲큳클큵큶큷큸큹큺큻큼큽큾큿",
		"Line  6" = "킀킁킂킃킄킅킆킇킈킉킊킋킌킍킎킏킐킑킒킓킔킕킖킗",
		"Line  7" = "킘킙킚킛킜킝킞킟킠킡킢킣키킥킦킧킨킩킪킫킬킭킮킯",
		"Line  8" = "킰킱킲킳킴킵킶킷킸킹킺킻킼킽킾킿타탁탂탃탄탅탆탇",
		"Line  9" = "탈탉탊탋탌탍탎탏탐탑탒탓탔탕탖탗탘탙탚탛태택탞탟",
		"Line 10" = "탠탡탢탣탤탥탦탧탨탩탪탫탬탭탮탯탰탱탲탳탴탵탶탷",
		"Line 11" = "탸탹탺탻탼탽탾탿턀턁턂턃턄턅턆턇턈턉턊턋턌턍턎턏",
		"Line 12" = "턐턑턒턓턔턕턖턗턘턙턚턛턜턝턞턟턠턡턢턣턤턥턦턧",
		"Line 13" = "턨턩턪턫턬턭턮턯터턱턲턳턴턵턶턷털턹턺턻턼턽턾턿",
		"Line 14" = "텀텁텂텃텄텅텆텇텈텉텊텋테텍텎텏텐텑텒텓텔텕텖텗",
		"Line 15" = "텘텙텚텛템텝텞텟텠텡텢텣텤텥텦텧텨텩텪텫텬텭텮텯",
		"Line 16" = "텰텱텲텳텴텵텶텷텸텹텺텻텼텽텾텿톀톁톂톃톄톅톆톇",
		"Line 17" = "톈톉톊톋톌톍톎톏톐톑톒톓톔톕톖톗톘톙톚톛톜톝톞톟",
		"Line 18" = "토톡톢톣톤톥톦톧톨톩톪톫톬톭톮톯톰톱톲톳톴통톶톷",
		"Line 19" = "톸톹톺톻톼톽톾톿퇀퇁퇂퇃퇄퇅퇆퇇퇈퇉퇊퇋퇌퇍퇎퇏",
		"Line 20" = "퇐퇑퇒퇓퇔퇕퇖퇗퇘퇙퇚퇛퇜퇝퇞퇟퇠퇡퇢퇣퇤퇥퇦퇧",
		"Line 21" = "퇨퇩퇪퇫퇬퇭퇮퇯퇰퇱퇲퇳퇴퇵퇶퇷퇸퇹퇺퇻퇼퇽퇾퇿",
		"Line 22" = "툀툁툂툃툄툅툆툇툈툉툊툋툌툍툎툏툐툑툒툓툔툕툖툗",
		"Line 23" = "툘툙툚툛툜툝툞툟툠툡툢툣툤툥툦툧툨툩툪툫투툭툮툯",
	},
	"Jamo18": {
		"Line  0" = "툯툰툱툲툳툴툵툶툷툸툹툺툻툼툽툾툿퉀퉁퉂퉃퉄퉅퉆",
		"Line  1" = "퉇퉈퉉퉊퉋퉌퉍퉎퉏퉐퉑퉒퉓퉔퉕퉖퉗퉘퉙퉚퉛퉜퉝퉞",
		"Line  2" = "퉟퉠퉡퉢퉣퉤퉥퉦퉧퉨퉩퉪퉫퉬퉭퉮퉯퉰퉱퉲퉳퉴퉵퉶",
		"Line  3" = "퉷퉸퉹퉺퉻퉼퉽퉾퉿튀튁튂튃튄튅튆튇튈튉튊튋튌튍튎",
		"Line  4" = "튏튐튑튒튓튔튕튖튗튘튙튚튛튜튝튞튟튠튡튢튣튤튥튦",
		"Line  5" = "튧튨튩튪튫튬튭튮튯튰튱튲튳튴튵튶튷트특튺튻튼튽튾",
		"Line  6" = "튿틀틁틂틃틄틅틆틇틈틉틊틋틌틍틎틏틐틑틒틓틔틕틖",
		"Line  7" = "틗틘틙틚틛틜틝틞틟틠틡틢틣틤틥틦틧틨틩틪틫틬틭틮",
		"Line  8" = "틯티틱틲틳틴틵틶틷틸틹틺틻틼틽틾틿팀팁팂팃팄팅팆",
		"Line  9" = "팇팈팉팊팋파팍팎팏판팑팒팓팔팕팖팗팘팙팚팛팜팝팞",
		"Line 10" = "팟팠팡팢팣팤팥팦팧패팩팪팫팬팭팮팯팰팱팲팳팴팵팶",
		"Line 11" = "팷팸팹팺팻팼팽팾팿퍀퍁퍂퍃퍄퍅퍆퍇퍈퍉퍊퍋퍌퍍퍎",
		"Line 12" = "퍏퍐퍑퍒퍓퍔퍕퍖퍗퍘퍙퍚퍛퍜퍝퍞퍟퍠퍡퍢퍣퍤퍥퍦",
		"Line 13" = "퍧퍨퍩퍪퍫퍬퍭퍮퍯퍰퍱퍲퍳퍴퍵퍶퍷퍸퍹퍺퍻퍼퍽퍾",
		"Line 14" = "퍿펀펁펂펃펄펅펆펇펈펉펊펋펌펍펎펏펐펑펒펓펔펕펖",
		"Line 15" = "펗페펙펚펛펜펝펞펟펠펡펢펣펤펥펦펧펨펩펪펫펬펭펮",
		"Line 16" = "펯펰펱펲펳펴펵펶펷편펹펺펻펼펽펾펿폀폁폂폃폄폅폆",
		"Line 17" = "폇폈평폊폋폌폍폎폏폐폑폒폓폔폕폖폗폘폙폚폛폜폝폞",
		"Line 18" = "폟폠폡폢폣폤폥폦폧폨폩폪폫포폭폮폯폰폱폲폳폴폵폶",
		"Line 19" = "폷폸폹폺폻폼폽폾폿퐀퐁퐂퐃퐄퐅퐆퐇퐈퐉퐊퐋퐌퐍퐎",
		"Line 20" = "퐏퐐퐑퐒퐓퐔퐕퐖퐗퐘퐙퐚퐛퐜퐝퐞퐟퐠퐡퐢퐣퐤퐥퐦",
		"Line 21" = "퐧퐨퐩퐪퐫퐬퐭퐮퐯퐰퐱퐲퐳퐴퐵퐶퐷퐸퐹퐺퐻퐼퐽퐾",
		"Line 22" = "퐿푀푁푂푃푄푅푆푇푈푉푊푋푌푍푎푏푐푑푒푓푔푕푖",
		"Line 23" = "푗푘푙푚푛표푝푞푟푠푡푢푣푤푥푦푧푨푩푪푫푬푭푮",
	},
	"Jamo19": {
		"Line  0" = "푮푯푰푱푲푳푴푵푶푷푸푹푺푻푼푽푾푿풀풁풂풃풄풅",
		"Line  1" = "풆풇품풉풊풋풌풍풎풏풐풑풒풓풔풕풖풗풘풙풚풛풜풝",
		"Line  2" = "풞풟풠풡풢풣풤풥풦풧풨풩풪풫풬풭풮풯풰풱풲풳풴풵",
		"Line  3" = "풶풷풸풹풺풻풼풽풾풿퓀퓁퓂퓃퓄퓅퓆퓇퓈퓉퓊퓋퓌퓍",
		"Line  4" = "퓎퓏퓐퓑퓒퓓퓔퓕퓖퓗퓘퓙퓚퓛퓜퓝퓞퓟퓠퓡퓢퓣퓤퓥",
		"Line  5" = "퓦퓧퓨퓩퓪퓫퓬퓭퓮퓯퓰퓱퓲퓳퓴퓵퓶퓷퓸퓹퓺퓻퓼퓽",
		"Line  6" = "퓾퓿픀픁픂픃프픅픆픇픈픉픊픋플픍픎픏픐픑픒픓픔픕",
		"Line  7" = "픖픗픘픙픚픛픜픝픞픟픠픡픢픣픤픥픦픧픨픩픪픫픬픭",
		"Line  8" = "픮픯픰픱픲픳픴픵픶픷픸픹픺픻피픽픾픿핀핁핂핃필핅",
		"Line  9" = "핆핇핈핉핊핋핌핍핎핏핐핑핒핓핔핕핖핗하학핚핛한핝",
		"Line 10" = "핞핟할핡핢핣핤핥핦핧함합핪핫핬항핮핯핰핱핲핳해핵",
		"Line 11" = "핶핷핸핹핺핻핼핽핾핿햀햁햂햃햄햅햆햇했행햊햋햌햍",
		"Line 12" = "햎햏햐햑햒햓햔햕햖햗햘햙햚햛햜햝햞햟햠햡햢햣햤향",
		"Line 13" = "햦햧햨햩햪햫햬햭햮햯햰햱햲햳햴햵햶햷햸햹햺햻햼햽",
		"Line 14" = "햾햿헀헁헂헃헄헅헆헇허헉헊헋헌헍헎헏헐헑헒헓헔헕",
		"Line 15" = "헖헗험헙헚헛헜헝헞헟헠헡헢헣헤헥헦헧헨헩헪헫헬헭",
		"Line 16" = "헮헯헰헱헲헳헴헵헶헷헸헹헺헻헼헽헾헿혀혁혂혃현혅",
		"Line 17" = "혆혇혈혉혊혋혌혍혎혏혐협혒혓혔형혖혗혘혙혚혛혜혝",
		"Line 18" = "혞혟혠혡혢혣혤혥혦혧혨혩혪혫혬혭혮혯혰혱혲혳혴혵",
		"Line 19" = "혶혷호혹혺혻혼혽혾혿홀홁홂홃홄홅홆홇홈홉홊홋홌홍",
		"Line 20" = "홎홏홐홑홒홓화확홖홗환홙홚홛활홝홞홟홠홡홢홣홤홥",
		"Line 21" = "홦홧홨황홪홫홬홭홮홯홰홱홲홳홴홵홶홷홸홹홺홻홼홽",
		"Line 22" = "홾홿횀횁횂횃횄횅횆횇횈횉횊횋회획횎횏횐횑횒횓횔횕",
		"Line 23" = "횖횗횘횙횚횛횜횝횞횟횠횡횢횣횤횥횦횧효횩횪횫횬횭",
	},
	"Jamo20": {
		"Line  0" = "횭횮횯횰횱횲횳횴횵횶횷횸횹횺횻횼횽횾횿훀훁훂훃후",
		"Line  1" = "훅훆훇훈훉훊훋훌훍훎훏훐훑훒훓훔훕훖훗훘훙훚훛훜",
		"Line  2" = "훝훞훟훠훡훢훣훤훥훦훧훨훩훪훫훬훭훮훯훰훱훲훳훴",
		"Line  3" = "훵훶훷훸훹훺훻훼훽훾훿휀휁휂휃휄휅휆휇휈휉휊휋휌",
		"Line  4" = "휍휎휏휐휑휒휓휔휕휖휗휘휙휚휛휜휝휞휟휠휡휢휣휤",
		"Line  5" = "휥휦휧휨휩휪휫휬휭휮휯휰휱휲휳휴휵휶휷휸휹휺휻휼",
		"Line  6" = "휽휾휿흀흁흂흃흄흅흆흇흈흉흊흋흌흍흎흏흐흑흒흓흔",
		"Line  7" = "흕흖흗흘흙흚흛흜흝흞흟흠흡흢흣흤흥흦흧흨흩흪흫희",
		"Line  8" = "흭흮흯흰흱흲흳흴흵흶흷흸흹흺흻흼흽흾흿힀힁힂힃힄",
		"Line  9" = "힅힆힇히힉힊힋힌힍힎힏힐힑힒힓힔힕힖힗힘힙힚힛힜",
		"Line 10" = "힝힞힟힠힡힢힣",
	},
	"symbol-gbk1": {
		"Line 0" = "ˉ∶∑∏∷⊙≌≮≯≤≥⒈⒉⒊⒋⒌",
		"Line 1" = "⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛⑴",
		"Line 2" = "⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄",
		"Line 3" = "⒅⒆⒇㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩ㄅㄆㄇ",
		"Line 4" = "ㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗ",
		"Line 5" = "ㄘㄙㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦㄧ",
		"Line 6" = "ㄨㄩ┄┅┆┇┈┉┊┋┍┎┑┒┕┖",
		"Line 7" = "┙┚┞┟┡┢┦┧┩┪┭┮┱┲┵┶",
		"Line 8" = "┹┺┽┾╀╁╃╄╅╆╇╈╉╊",
	},
	"kanji-gbk2 1": {
		"Line  0" = "皑蔼爱肮翱袄坝罢摆败颁办绊绑镑谤饱报鲍辈贝钡狈备惫绷甭泵蹦毕毙币",
		"Line  1" = "闭边编贬变辩辫标鳖别瘪濒滨宾摈饼拨钵铂驳补财踩惭灿苍舱仓沧厕侧测",
		"Line  2" = "层查碴诧搀掺馋谗缠铲产阐颤场尝长偿肠畅钞车彻尘陈衬惩诚骋迟驰齿炽",
		"Line  3" = "宠绸瞅锄雏础储处传疮闯创锤纯绰词赐聪丛蹿篡窜错带贷单郸掸诞弹挡荡",
		"Line  4" = "捣岛导邓敌涤递缔颠垫电惦碉叼钓调谍盯钉顶锭订丢东动栋冻犊读赌镀锻",
		"Line  5" = "缎兑队对顿钝夺垛躲朵跺剁鹅额讹恶饿尔饵贰发罚阀珐矾钒烦贩饭访纺飞",
		"Line  6" = "诽废费纷坟奋愤粪枫锋风疯冯缝讽凤辐抚辅赋负讣妇缚该钙溉秆赣冈刚钢",
		"Line  7" = "纲岗镐搁鸽阁铬给埂龚宫贡钩购够蛊顾剐观馆惯贯规归龟闺轨诡贵刽辊滚",
		"Line  8" = "锅过骇韩焊汉嚎阂鹤贺轰鸿红壶唬护户哗华话怀欢环还缓换唤痪焕涣谎挥",
		"Line  9" = "辉毁贿秽烩汇讳诲绘荤浑获货祸击积饥讥鸡姬绩缉辑级挤蓟剂济计记际继",
		"Line 10" = "纪夹荚颊贾钾驾歼监坚笺间艰缄茧检硷拣捡简俭槛鉴贱见键舰剑饯渐溅涧",
		"Line 11" = "浆桨奖讲酱浇骄娇搅铰矫侥饺缴绞轿较阶节洁结诫紧锦仅谨进劲荆鲸经颈",
		"Line 12" = "镜痉竞净纠驹举锯剧鹃绢觉诀绝钧军骏凯颗课啃垦恳抠库裤垮挎块侩宽矿",
		"Line 13" = "旷亏岿窥馈溃扩阔赖蓝栏拦篮阑兰澜谰揽览懒缆烂滥捞劳涝乐镭垒类篱鲤",
		"Line 14" = "丽厉砾历沥俩联莲连镰涟敛脸链炼练辆谅疗辽撂镣猎临邻鳞赁龄铃领馏龙",
		"Line 15" = "聋咙笼垄拢陇搂篓卢颅庐掳卤虏鲁赂录陆驴吕铝侣缕虑氯滤绿峦挛孪滦抡",
		"Line 16" = "轮伦仑沦纶论萝罗逻锣箩骡骆络妈玛码蚂马骂吗买卖迈瞒馒满谩锚铆贸酶",
		"Line 17" = "镁门闷们锰醚谜觅幂绵缅庙灭悯闽鸣铭谬谋亩呐钠纳氖难挠脑恼闹馁拟腻",
		"Line 18" = "撵酿鸟聂啮镊镍柠狞拧泞钮纽脓浓农疟诺鸥沤啪趴盘乓庞耪呸赔喷鹏骗飘",
		"Line 19" = "频贫乒评泼颇铺谱沏脐齐骑岂讫牵扦钎铅签谦钱钳谴堑枪呛墙蔷强抢锹桥",
		"Line 20" = "乔侨翘窍钦亲轻氢倾氰顷请庆琼穷趋驱龋颧权醛劝鹊让饶扰绕热韧认纫绒",
		"Line 21" = "软锐闰润萨鳃赛叁伞丧骚扫涩杀纱啥筛删闪陕赡缮墒伤赏烧绍赊摄慑设绅",
		"Line 22" = "审婶肾绳胜师狮诗时蚀实识驶势释饰视试兽输书赎术树竖帅谁顺说硕烁丝",
		"Line 23" = "饲耸怂颂讼诵擞苏诉肃虽绥岁孙损缩琐锁獭挞酞态摊贪瘫滩坛谭谈叹汤烫",
		"Line 24" = "绦讨腾誊锑题屉贴铁厅烃酮铜捅统偷头秃图团颓蜕鸵驮驼椭顽烷韦违围为",
		"Line 25" = "潍维苇伟伪纬谓卫闻纹稳问嗡挝蜗涡窝呜钨乌污诬芜坞雾务误矽锡牺烯袭",
		"Line 26" = "习铣戏细虾辖锨鲜纤贤衔闲显险现县馅宪线厢镶乡详项萧嚣销晓啸协胁谐",
		"Line 27" = "谢锌兴锈绣须许绪续轩悬选癣绚勋询寻驯训讯逊压鸦鸭哑亚讶阉盐严颜阎",
		"Line 28" = "艳厌砚谚验鸯杨扬疡样摇尧谣药爷页业铱颐遗仪蚁艺亿忆义诣议谊译绎荫",
		"Line 29" = "银饮隐樱婴鹰应缨莹萤营荧蝇赢颖哟拥痈优忧邮铀诱榆舆俞鱼渔娱屿语喻",
		"Line 30" = "狱预驭鸳辕员圆缘远约跃钥阅郧陨蕴酝晕砸杂载攒暂赞赃脏凿枣责择则泽",
		"Line 31" = "贼赠喳轧铡闸栅诈斋债盏斩辗崭栈战绽张涨帐账胀赵蛰辙锗这贞针侦诊镇",
	},
	"kanji-gbk2 2": {
		"Line  0" = "阵挣睁狰帧郑证织职执值纸挚掷帜质钟终肿诌轴皱骤诸诛烛贮铸驻专砖转",
		"Line  1" = "赚桩妆锥赘坠缀谆浊兹资渍综总纵邹揍诅组钻孬亓芈啬厍厣靥赝匦匮赜刭",
		"Line  2" = "刿剀劁劐仉伛伢伥伧伫佧伲佴侪侬俨俪偾偻傥傧傩僬氽佥汆籴黉冁凫兖衮",
		"Line  3" = "亵脔凇讠讦讧讪讴讵讷诂诃诋诏诎诒诓诔诖诘诙诜诟诠诤诨诩诮诰诳诶诹",
		"Line  4" = "诼诿谀谂谄谇谌谏谑谒谔谕谖谙谛谘谝谟谠谡谥谧谪谫谮谯谲谳谵谶陉陧",
		"Line  5" = "邝邬邺郏郐郓郦刍奂劢凼巯圹坜垅垆坶垭垲垴埘埚埙埯塄塥塬墚芏芗苈苊",
		"Line  6" = "苋苌苁苄苎茏苘茑茚茔茕荛荜荞荟荠荦荥荨荩荬荪荭荮莰莳莴莶莸莺莼堇",
		"Line  7" = "萘萜萦蒇蒈蒉蒌蒎蓦蓠蓥蓣蔸蔹蔺蔻蕲藓夼奁尥尴扪抟挢掼揿揞摅摁搋搛",
		"Line  8" = "搌搡摞撄撖撷撸撺擀攥甙卟叽叻吖吆呋呒呓呔呖呗呙吣吲咂咔咚咛咝哐咴",
		"Line  9" = "哒哓哔呲咣哕哌哙哚哜哝哏哞唛哧唠唢唣唑唧啧喵啭啕唿唷啵啶啷唰喱喹",
		"Line 10" = "嗖喽喾嗪嘟嗫嗬嗦嗯嗥嗲嗳嗍嗨嗵辔嘞嘌嘁嘤嘣嘀嘧嘭噘噗噙噜噻噼嚓嚯",
		"Line 11" = "囔囵帏帱帻帼岍岖岘岙岚岜岽峁峄峤峥崂崃崮崞嵘崾嵛嵝嵫嵴巅徕犷犸狍",
		"Line 12" = "狨狯狲猁猃猡猕猸獾饣饧饨饩饪饫饬饴饷饽馀馄馇馊馍馐馑馓馔馕庑赓廪",
		"Line 13" = "忏怃怄忾怅怆怿恸恹恻恺恽悭惬愦愣憷懔闩闫闱闳闵闶闼闾阃阄阆阈阊阋",
		"Line 14" = "阌阍阏阒阕阖阗阙阚沣汩沩泷泸泺泾浃浈浍浏浒浔涞涠渎渑渖渌溆滟滠滢",
		"Line 15" = "滗潆潇漤潋澉潲濑瀵灏骞迳逦屦弪妩妪妫妞姗娅娆娈姘姹娲娴婊婵胬媪嫫",
		"Line 16" = "嫒嫔嫱嫘嬷尕尜孓孢驵驷驸驺驿驽骀骁骅骈骊骐骒骓骖骘骛骜骝骟骠骢骣",
		"Line 17" = "骥骧纟纡纣纥纨纩纭纰纾绀绁绂绉绋绌绐绔绗绛绠绡绨绫绮绯绱绲缍绶绺",
		"Line 18" = "绻绾缁缂缃缇缈缋缌缏缑缒缗缙缜缛缟缡缢缣缤缥缦缧缪缫缬缭缯缰缱缲",
		"Line 19" = "缳缵玑玮珑顼玺珲琏瑷璎瓒韪韫韬杩枥枧枨枞枭栉栊栌栀栎柽桠桡桢桤桦",
		"Line 20" = "棂椟椠椤榄榇榈榉槔槟槠樯樘橥橹橼檩殇殒殓殚殡轫轭轱轲轳轵轶轸轷轹",
		"Line 21" = "轺轼轾辁辂辄辇辋辍辎辏辘辚軎戋戗戥戤戬甏旮旯昙晔晖暧贲贳贶贻贽赀",
		"Line 22" = "赅赆赈赉赇赍赕赙觇觊觋觌觎觏觐觑犟牦犋犏掰毪毽毵氇氆氕氘氚氡氩氪",
		"Line 23" = "氲牍肟肼朊肽肷胧胨胩胪胂朐胫脎脒脶脲腈腙腚腼腽膑膪臌膦飑飒飓飕飙",
		"Line 24" = "飚毂齑斓炀炜炝烀烨焐焓焖煳煲煸煺熘熵焘祯禚怼悫懑戆肀泶矶砀砗砘砜",
		"Line 25" = "砹砻砟砼砩硭硖硗硐碛碜碹碥磙礅礓礤龛眍睐睑睃疃罴羁钅钆钇钋钊钌钍",
		"Line 26" = "钏钐钔钗钕钚钛钜钣钤钫钪钭钬钯钰钲钴钶钷钸钹钺钼钽钿铄铈铉铊铋铌",
		"Line 27" = "铍铎铐铑铒铕铖铗铙铘铛铞铟铠铢铤铥铧铨铪铩铫铮铯铳铴铵铷铹铼铽铿",
		"Line 28" = "锃锂锆锇锉锊锍锎锏锒锓锔锕锖锘锛锝锞锟锢锪锫锩锬锱锲锴锶锷锸锼锾",
		"Line 29" = "锿镂锵镄镅镆镉镌镎镏镒镓镔镖镗镘镙镛镞镟镝镡镢镤镥镦镧镨镩镪镫镬",
		"Line 30" = "镯镱镲镳锺稆穑鸠鸢鸨鸩鸪鸫鸬鸲鸱鸶鸸鸷鸹鸺鸾鹁鹂鹄鹆鹇鹈鹉鹋鹌鹎",
		"Line 31" = "鹑鹕鹗鹚鹛鹜鹞鹣鹦鹧鹨鹩鹪鹫鹬鹱鹭鹳疖疠疬痖痨痦痫瘐瘅瘗瘿瘾癍癞",
	},
	"kanji-gbk2 3": {
		"Line  0" = "癔癫窦窨窭裆裉裢裣裥褡褛褴皲耢耥",
		"Line  1" = "耧耩耱聍聩顸颀颃颉颌颍颏颔颚颛颞",
		"Line  2" = "颟颡颢颥颦虮虿虼蚬蚺蛏蛱蛲蛳蛐蛴",
		"Line  3" = "蛘蝈蜢蝽蝾蝰螨蟓蟑蟛蟮罂笃笕笸笤",
		"Line  4" = "笾筘筚筻筢箦箧箨箅箢箫篑簖籁舣舭",
		"Line  5" = "舯舻舾袅羟羧羰粑粝粜糁糌糨暨絷趔",
		"Line  6" = "趱酐酰酯酽酾醌醣鹾趸趿跄跞跷跸跹",
		"Line  7" = "跻踬踮踯踺蹑蹒躏躜觞觯靓雳霁霭龀",
		"Line  8" = "龃龅龆龇龈龉龊龌黾鼋鼍雠銮錾鐾鱿",
		"Line  9" = "鲂鲅鲆鲇鲈稣鲋鲎鲐鲑鲒鲔鲕鲚鲛鲞",
		"Line 10" = "鲟鲠鲡鲢鲣鲥鲦鲧鲨鲩鲫鲭鲮鲰鲱鲲",
		"Line 11" = "鲳鲴鲵鲶鲷鲺鲻鲼鲽鳄鳅鳆鳇鳊鳋鳌",
		"Line 12" = "鳍鳎鳏鳐鳓鳔鳕鳗鳘鳙鳜鳝鳟鳢鞑鞒",
		"Line 13" = "鞔鞯骱鹘骺髅髂髋髌魇魉飨餍髡鬏鬓",
		"Line 14" = "黢黩黪",
	},
}


# 10 is probably overkill, however that should be enough to cover all the font.
# Except wingdings. Fuck wingdings.
# Maybe in the future I should reorganize the font section to be only 1 line,
# so that it should never have character inside each other. Tho that mean some
# character may be cut off, but honestly ? I blame the font maker zzzzz.
const border_fix: int = 10


var current_step: int = 0
var max_steps: int = steps.size()
var folder_name: String = ""
@onready var world: Control = $World


func start_render(
	font_path: String,
	font_size: int,
	doubleres: bool,
	font_name: String = "",
	fix_alpha_pixels: bool = true
	) -> void:
	if not FileAccess.file_exists(font_path):
		emit_signal("error", errors.FontNotFound)
		return
	
#	if not font_path.get_extension() in valid_extensions:
#		emit_signal("error", errors.InvalidFile)
#		return
	
	var font: FontFile = FontFile.new()
	font.load_dynamic_font(font_path)
	
	if font_name == "":
		font_name = font.get_font_name() + " " + font.get_font_style_name() + " " + str(font_size) + "px"
	else:
		font_name += " " + str(font_size) + "px"
	
	if not font_name.is_valid_filename():
		emit_signal("error", errors.InvalidName)
		return
	
	folder_name = font_name
	if not DirAccess.dir_exists_absolute(ProjectSettings.globalize_path("user://") + folder_name):
		create_folder()
	
	var start_time: int = Time.get_ticks_msec()
	
	current_step = 0
	emit_signal("set_max_step", steps.size())
	
	var ini_contents: PackedStringArray = []
	
	var height_finder = Label.new()
	height_finder.add_theme_font_override("font", font)
	if doubleres:
		font_size *= 2
	height_finder.add_theme_font_size_override("font_size", font_size)
	if doubleres:
		font_size /= 2
	self.add_child(height_finder)
	var true_height: int = height_finder.size.y + border_fix
	height_finder.queue_free()
	
	ini_contents.append("[common]\n")
	ini_contents.append("Baseline=" + str(floor(float(true_height) / 2)) + "\n")
	ini_contents.append("Top=0\n")
	ini_contents.append("LineSpacing=" + str(floor(float(true_height) / 2)) + "\n")
	ini_contents.append("DrawExtraPixelsLeft=0\n")
	ini_contents.append("DrawExtraPixelsRight=0\n")
	ini_contents.append("AdvanceExtraPixels=0\n\n")
	
	for section in sections:
		current_step += 1
		emit_signal("set_current_step", current_step, steps[current_step])
		# use this to test a single section
#		if section != "symbol2":
#			continue
		
		if doubleres:
			font_size *= 2
		
		var ini_section: String = "[" + section + "]\n"
		var ini_value: String = ""
		var y: int = 0
		var max_x: int = 0
		var char_num:int = 0
		
		for line in sections[section]:
			ini_section += line + "="
			var x: int = 0
			for character in sections[section][line]:
				ini_section += character
				
				var label = Label.new()
				label.add_theme_font_override("font", font)
				label.add_theme_font_size_override("font_size", font_size)
				label.add_theme_color_override("font_color", Color.WHITE)
				label.add_theme_color_override("font_outline_color", Color.WHITE)
				label.add_theme_constant_override("outline_size", 0)
				label.vertical_alignment = VERTICAL_ALIGNMENT_CENTER
				label.horizontal_alignment = HORIZONTAL_ALIGNMENT_CENTER
				world.add_child(label)
				
				label.text = character
				
				# If the value is 0, it mean the font doesn't support the character,
				# so replace it.
				if font.get_string_size(label.text, HORIZONTAL_ALIGNMENT_CENTER, -1, font_size).x == 0:
					label.text = "�"
				
				# Resetting the size is necessary otherwise the character will not
				# be properly centered.
				label.reset_size()
				
				# add extra border, in case of a character touching the border,
				# otherwise etterna will do some funny rendering.
				# Some fonts however do have characters that goes over their size,
				# and will end up bugged either way. (ex: Wingdings)
				label.size.x += border_fix
				label.size.y += border_fix
				
				if label.size.x > label.size.y:
					label.size.y = label.size.x
				else:
					label.size.x = label.size.y
				
				label.scale.y = true_height / label.size.y
				label.scale.x = label.scale.y
				
				label.position = Vector2i(true_height * x, true_height * y)
				
				if doubleres:
					font_size /= 2
				ini_value += str(char_num) + "=" + str(
					floor(
						font.get_string_size(label.text, HORIZONTAL_ALIGNMENT_CENTER, -1, font_size).x * label.scale.x
						)
					) + "\n"
				if doubleres:
					font_size *= 2
					
				char_num += 1
				x += 1
			
			y += 1
			if max_x < x:
				max_x = x
			
			ini_section += "\n"
		
		ini_contents.append(ini_section + "\n")
		ini_contents.append(ini_value + "\n")
		self.size = Vector2i(max_x * true_height, y * true_height)
		
		# Wait 2 frames for the viewport to properly update
		await get_tree().process_frame
		await get_tree().process_frame
		
		if doubleres:
			font_size /= 2
		
		var filename: String = font_name + " [" + section + "] " + str(max_x) + "x" + str(y)
		
		if doubleres:
			filename += " (doubleres)"
		save_image(filename, fix_alpha_pixels)
		
		for label in world.get_children():
			label.queue_free()
	
	current_step += 1
	emit_signal("set_current_step", current_step, steps[current_step])
	
	save_file(ini_contents, font_name)
	
	current_step += 1
	emit_signal("set_current_step", current_step, steps[current_step])
	
	print("Generation took " + str(Time.get_ticks_msec() - start_time) + "ms.")


func create_folder() -> void:
	var dir = DirAccess.open("user://")
	dir.make_dir(folder_name)


func save_file(contents: PackedStringArray, filename: String) -> void:
	var file = FileAccess.open("user://" + folder_name + "/" + filename + ".ini", FileAccess.WRITE)
	for content in contents:
		file.store_string(content)
	file.close()


func save_image(filename: String, fix_alpha_pixels: bool) -> void:
	var img: Image = self.get_viewport().get_texture().get_image()
	img.convert(Image.FORMAT_RGBA8)
	
	# Set all pixels to white, as the background being transparent make
	# alpha pixel have a black background.
	# check only against symbol due to sex icon being colored sometimes.
	if fix_alpha_pixels:
		if "symbol2" in filename:
			for y in img.get_height():
				for x in img.get_width():
					var px: Color = img.get_pixel(x, y)
					if px.r == px.g and px.r == px.b:
						img.set_pixel(x, y, Color(1,1,1,img.get_pixel(x, y).a))
		else:
			for y in img.get_height():
				for x in img.get_width():
					img.set_pixel(x, y, Color(1,1,1,img.get_pixel(x, y).a))
	
	img.save_png("user://" + folder_name + "/" + filename + ".png")
